{
    "External ID": "1",
    "children": [
        {
            "External ID": "2",
            "children": [
                {
                    "External ID": "6",
                    "children": [
                        {
                            "External ID": "11",
                            "description": "Determine Eligibility defines a managed process for assessing and determining beneficiary entitlement to inpatient and outpatient medical care and treatment services, based on the enrollee's eligibility status. Determining an enrollee's eligibility status requires verification of military service, as well as the type and status of discharge from active service.",
                            "name": "Determine Eligibility",
                            "number": "1.1.1",
                            "parent": "Provide Member Access"
                        },
                        {
                            "External ID": "7",
                            "description": "Perform Enrollment involves all aspects of the enrollment process for medical services including:  beneficiary identity and administrative data management, beneficiary information gathering, annual enrollment review, and the use and maintenance of the beneficiary enrollment system.",
                            "name": "Perform Enrollment",
                            "number": "1.1.2",
                            "parent": "Provide Member Access"
                        },
                        {
                            "External ID": "13",
                            "description": "Determine Allowable Services is the process for ascertaining the appropriate level of benefit services for beneficiaries based on established eligibility requirements (e.g., presence of a service-related condition and meeting defined income thresholds).  Beneficiaries are provided a certain level of access to care based on defined policies and regulations (e.g., predetermined priority groups).",
                            "name": "Determine Allowable Services",
                            "number": "1.1.3",
                            "parent": "Provide Member Access"
                        },
                        {
                            "External ID": "15",
                            "description": "Perform Registration is the process of registering the Veteran for medical services.  Registration entails processing registrations at assigned health care facilities, assigning Veterans to preferred health care facilities, and establishing health record and fiscal accounts at facilities. The registration process supports bi-directional registration between the Department of Defense and the Department of Veterans Affairs.  Entering basic demographic data into a common interface will create a unique patient file in both agencies' electronic health record systems.",
                            "name": "Perform Registration",
                            "number": "1.1.4",
                            "parent": "Provide Member Access"
                        },
                        {
                            "External ID": "30",
                            "description": "Manage Appointments provides for the scheduling, cancelling, coordinating, and viewing of appointments. This may include initial and follow-up appointments with the Primary Care Provider and all consultations or referrals as required for comprehensive care within the VA and DoD. It also includes managing and monitoring patients on the Electronic Wait List to ensure they receive care based on established guidelines.  Another business activity included is patient check-In for appointment, which precedes delivery of care by identifying the patient and staging the patient for an encounter with a provider.",
                            "name": "Manage Appointments",
                            "number": "1.1.5",
                            "parent": "Provide Member Access"
                        },
                        {
                            "External ID": "765",
                            "description": "Monitor Access Status tracks and reports the access state of Veterans and Veteran populations. Access status includes the current state and history of eligibility, enrollment, allowable services, and registration.",
                            "name": "Monitor Access Status",
                            "number": "1.1.6",
                            "parent": "Provide Member Access"
                        }
                    ],
                    "description": "Provide Member Access serves as the front-end of the medical care value chain and encompasses all aspects of enrollment, eligibility, level of allowable services and facility registration.",
                    "name": "Provide Member Access",
                    "number": "1.1",
                    "parent": "Provide Access to Health Care"
                },
                {
                    "External ID": "31",
                    "children": [
                        {
                            "External ID": "34",
                            "description": "Communicate Process Appeal and/or Notice of Disagreement provides Veterans with a way to appeal decisions made by an organization's regional office or medical center.",
                            "name": "Communicate Process Appeal and/or Notice of Disagreement",
                            "number": "1.2.1",
                            "parent": "Provide Communications and Outreach"
                        },
                        {
                            "External ID": "17",
                            "description": "Reach out to Veterans and Communicate Benefits supports outreach services to Veterans and provides information about available benefits, eligibility requirements, and how to apply for benefits.",
                            "name": "Reach out to Veterans and Communicate Benefits",
                            "number": "1.2.2",
                            "parent": "Provide Communications and Outreach"
                        }
                    ],
                    "description": "Provide Communications and Outreach conceptualizes, develops, coordinates and implements national health communications programs for America's Veterans.",
                    "name": "Provide Communications and Outreach",
                    "number": "1.2",
                    "parent": "Provide Access to Health Care"
                },
                {
                    "External ID": "656",
                    "description": "Provide Homeless Veterans Access to Health Care is the function whereby Department of Veterans Affairs (VA) social workers and other mental health clinicians assist homeless Veterans who are eligible for VA health care and other  benefits. This function also provides a mechanism to contract with providers for community-based residential treatment for homeless Veterans.",
                    "name": "Provide Homeless Veterans Access to Health Care",
                    "number": "1.3",
                    "parent": "Provide Access to Health Care"
                },
                {
                    "External ID": "22",
                    "description": "Facilitate Patient Travel to Points of Care involves the activities associated with planning, preparing, monitoring, and approving transportation for patients who require transportation to or from facilities and other locations for examination, treatment or care.",
                    "name": "Facilitate Patient Travel to Points of Care",
                    "number": "1.4",
                    "parent": "Provide Access to Health Care"
                },
                {
                    "External ID": "25",
                    "children": [
                        {
                            "External ID": "26",
                            "description": "Change Preferred Facility Assignment is the process for managing requests to change facility assignments, based on preferred location.",
                            "name": "Change Preferred Facility Assignment",
                            "number": "1.5.1",
                            "parent": "Assign Patient to Care Provider"
                        },
                        {
                            "External ID": "27",
                            "description": "Change Primary Care Physician Assignment allows a patient to change their primary care provider to one who is best able to meet the patient’s needs.",
                            "name": "Change Primary Care Physician Assignment",
                            "number": "1.5.2",
                            "parent": "Assign Patient to Care Provider"
                        }
                    ],
                    "description": "Assign Patient to Care Provider means assigning patients to practitioners and reassigning patients from one provider team to another provider team.",
                    "name": "Assign Patient to Care Provider",
                    "number": "1.5",
                    "parent": "Provide Access to Health Care"
                },
                {
                    "External ID": "752",
                    "description": "Provide Access to Self-Services involves providing the processes, tools, and knowledge to enable Veterans to actively manage their benefits and services. This includes implementing various mechanisms such as VA Point-of-Service devices to enable self-service VA business transactions for Veterans and other users.",
                    "name": "Provide Access to Self-Services",
                    "number": "1.6",
                    "parent": "Provide Access to Health Care"
                }
            ],
            "description": "Provide Access to Health Care enables access to appropriate health care. This includes streamlining efforts to receive care; ensuring care is appropriate in terms of type, care, intensity, location and availability; providing seamless access to health knowledge, enrolling providers; performing eligibility determination, and managing patient movement.",
            "name": "Provide Access to Health Care",
            "number": "1.0",
            "parent": "The Health Care Segment"
        },
        {
            "External ID": "657",
            "children": [
                {
                    "External ID": "226",
                    "description": "Coordinate with Health Agencies is the collaboration and partnering with Public Health Agencies on public health issues.",
                    "name": "Coordinate with Health Agencies",
                    "number": "2.1",
                    "parent": "Manage Public Health"
                },
                {
                    "External ID": "658",
                    "description": "Promote Environmental Health involves recommending policy, and developing educational and outreach materials focused on improving environmental parameters that potentially affects health. This includes evaluating, researching, recommending policy, and providing medical opinions on occupational and post-deployment environmental exposures.",
                    "name": "Promote Environmental Health",
                    "number": "2.2",
                    "parent": "Manage Public Health"
                },
                {
                    "External ID": "39",
                    "description": "Promote Clinical Public Health provides leadership with input on evidence-based health promotion and disease prevention policy.  This function provides programs, education, and field coordination consistent with prevention policy for enhancing health, well-being, and quality of life for Veterans.  This function also develops and distributes education materials aimed at promoting sound public health practices to Veterans and other health communities served by the Department of Veteran Affairs.",
                    "name": "Promote Clinical Public Health",
                    "number": "2.3",
                    "parent": "Manage Public Health"
                },
                {
                    "External ID": "660",
                    "description": "Conduct Public Health Assessment includes identifying, assessing and reporting on Veteran populations and the factors and interventions influencing their health.",
                    "name": "Conduct Public Health Assessment",
                    "number": "2.4",
                    "parent": "Manage Public Health"
                },
                {
                    "External ID": "133",
                    "description": "Provide Medical Registry Service establishes an organized system that uses observational study methods to collect uniform data (clinical and other) to evaluate specified outcomes for a population defined by a particular disease, condition, or exposure, and that serves a predetermined scientific, clinical, or policy purpose.  This system includes registries such as Spinal Cord Injury and Women's Health Care.",
                    "name": "Provide Medical Registry Service",
                    "number": "2.5",
                    "parent": "Manage Public Health"
                },
                {
                    "External ID": "225",
                    "description": "Provide Public Health Alerts is the process for notifying affected populations about health-related risks (e.g., providing alerts to nursing care facilities regarding an imminent influenza outbreak).  Alerts should include actions to be taken by the target population to mitigate the risks.",
                    "name": "Provide Public Health Alerts",
                    "number": "2.6",
                    "parent": "Manage Public Health"
                }
            ],
            "description": "Manage Public Health provides strategies to improve health by focusing on the well-being of the Veterans and VA health staff communities.  This includes developing and implementing public health policy that promotes disease prevention, risk reduction and improved health for the community.  Functions also include surveillance and epidemiology assessments.  Public health functions are also used to decrease health disparities and improve health outcomes in sub-populations of Veterans, such as women Veterans.",
            "name": "Manage Public Health",
            "number": "2.0",
            "parent": "The Health Care Segment"
        },
        {
            "External ID": "47",
            "children": [
                {
                    "External ID": "292",
                    "description": "Manage Health Care Costs and Administrative Efficiency provides the ability for health care providers to find solutions that could help them manage rising costs of health care as well as increase their overall administrative efficiency. This service helps provider practices become more fully automated and integrated into virtually every aspect of the value chain. It handles a range of administrative tasks from scheduling to revenue analysis.",
                    "name": "Manage Health Care Costs and Administrative Efficiency",
                    "number": "3.1",
                    "parent": "Provide Health Care Administration"
                },
                {
                    "External ID": "278",
                    "children": [
                        {
                            "External ID": "663",
                            "children": [
                                {
                                    "External ID": "664",
                                    "description": "Report Unsafe Conditions requires facility staff to report, as per local policy, any unsafe conditions of which they are aware, even though the conditions have not yet resulted in an adverse event or close call to the Patient Safety Manager (PSM).",
                                    "name": "Report Unsafe Conditions",
                                    "number": "3.2.1.1",
                                    "parent": "Manage Patient Safety"
                                },
                                {
                                    "External ID": "199",
                                    "description": "Evaluate Incidents focuses on the reporting and assessing of incidents that occur in the health care setting.  This function includes the reporting, tracking and monitoring of incidents, Adverse Events - including Adverse Drug Events (ADEs) and Sentinel Events, and Close Calls that may result in or have resulted in patient harm.  This function also includes the evaluation of the identified root causes and contributing factors for the close call or adverse event, as well as associated actions and outcome measures to mitigate future events from reoccurring within that facility. This activity is the primary mechanism through which the organization learns about health care system vulnerabilities and how to address them.",
                                    "name": "Evaluate Incidents",
                                    "number": "3.2.1.2",
                                    "parent": "Manage Patient Safety"
                                },
                                {
                                    "External ID": "665",
                                    "description": "Implement Patient Safety Improvement involves the reduction and prevention of inadvertent harm to patients as a result of their care.  This function incorporates findings from the root cause analysis, a known methodology for dealing with these safety-related issues, for more accurate and rapid communication throughout the organization of potential and actual causes of harm to patients, thus building local and national knowledge about systems vulnerabilities and enhancing the process of patient safety improvement. This function includes prevention and tracking of Adverse Drug Events (ADEs), Healthcare Associated Infections (HAIs) contracted in a care setting, following checklists, reporting safety incidents transparently and alerts.",
                                    "name": "Implement Patient Safety Improvement",
                                    "number": "3.2.1.3",
                                    "parent": "Manage Patient Safety"
                                },
                                {
                                    "External ID": "666",
                                    "description": "Manage Patient Safety Communications includes monitoring the internal Patient Safety Information database, other internal communication channels, and external publications (including those from organizations such as Federal Drug Administration and The Joint Commission) for information that may require the development of a Patient Safety Alert or Patient Safety Advisory.  It also involves prioritizing and researching potential Patient Safety Alert and Patient Safety Advisory topics to determine if dissemination of a Patient Safety Alert or Patient Safety Advisory is required.",
                                    "name": "Manage Patient Safety Communications",
                                    "number": "3.2.1.4",
                                    "parent": "Manage Patient Safety"
                                },
                                {
                                    "External ID": "145",
                                    "description": "Provide Positive Patient Identification (PPI) involves implementing the process that will increase positive patient identification, decrease patient misidentification and vulnerabilities in labeling of blood and laboratory specimens, and decrease the duplication of work (recording first on paper, and then manually entering into CPRS) associated with vital signs (VS) and intake and output (I&O) records.  PPI will be fully implemented at the point of care through scanning technology for specimen collection and blood product administration across the organization through the use of electronic devices compatible with organization standards. PPI is part of the organization's Initiative with Bar Code Expansion.",
                                    "name": "Provide Positive Patient identification",
                                    "number": "3.2.1.5",
                                    "parent": "Manage Patient Safety"
                                },
                                {
                                    "External ID": "667",
                                    "description": "Manage Nosocomial Infections includes tracking, monitoring and managing of all hospital acquired infections.",
                                    "name": "Manage Nosocomial Infections",
                                    "number": "3.2.1.6",
                                    "parent": "Manage Patient Safety"
                                }
                            ],
                            "description": "Manage Patient Safety activities include understanding the health care continuum as a system, and exploring system vulnerabilities that can result in patient harm.  It includes prevention and tracking of health care related infections contracted in a care setting, following checklists, reporting of adverse events (including sentinel events), unsafe conditions and close calls, incident evaluations and alerts. This function also represents the activities associated with patient safety communications and positive patient identification procedures.",
                            "name": "Manage Patient Safety",
                            "number": "3.2.1",
                            "parent": "Perform Hospital Administration"
                        },
                        {
                            "External ID": "18",
                            "children": [
                                {
                                    "External ID": "23",
                                    "description": "Admit Patient represents the activities to allow a patient to occupy a bed in order to receive treatment and be monitored by clinical staff. It also includes documenting a patient’s acceptance into a medical facility for the purpose of receiving treatment.",
                                    "name": "Admit Patient",
                                    "number": "3.2.2.1",
                                    "parent": "Manage Patient Admission, Discharge and Transfer"
                                },
                                {
                                    "External ID": "756",
                                    "description": "Discharge Patient includes the process activities for releasing a patient from a medical facility after treatment is completed.",
                                    "name": "Discharge Patient",
                                    "number": "3.2.2.2",
                                    "parent": "Manage Patient Admission, Discharge and Transfer"
                                },
                                {
                                    "External ID": "24",
                                    "description": "Transfer Patient includes the process and activities for moving a patient from one medical facility to another medical facility (VA or non-VA) or within a medical center from one level of care to another.",
                                    "name": "Transfer Patient",
                                    "number": "3.2.2.3",
                                    "parent": "Manage Patient Admission, Discharge and Transfer"
                                }
                            ],
                            "description": "Manage Patient Admission, Discharge and Transfer includes activities required to assume the responsibility of a patient’s whereabouts while receiving treatment at a VA medical facility.",
                            "name": "Manage Patient Admission, Discharge and Transfer",
                            "number": "3.2.2",
                            "parent": "Perform Hospital Administration"
                        },
                        {
                            "External ID": "289",
                            "description": "Manage Hospital Safety Program involves minimizing the risks and hazards in the physical environment and manages the staff activities to reduce the risk of occupational and environmental injuries. This includes management of biomedical maintenance, fire protection, evacuation plans, etc.",
                            "name": "Manage Hospital Safety Program",
                            "number": "3.2.3",
                            "parent": "Perform Hospital Administration"
                        },
                        {
                            "External ID": "63",
                            "description": "Evaluate Health Care Regulatory Compliance involves an evaluation of an organization’s compliance with applicable laws, regulations and policies and focuses on systems critical to the safety and the quality of care, treatment and services.  This includes compliance with guidelines developed by The Joint Commission, Nuclear Regulatory Commission, the College of American Pathologists, and other regulatory agencies.",
                            "name": "Evaluate Health Care Regulatory Compliance",
                            "number": "3.2.4",
                            "parent": "Perform Hospital Administration"
                        },
                        {
                            "External ID": "288",
                            "description": "Manage Facility Volunteer Program includes the establishment, operation, and monitoring of hospital and clinic volunteer services which include recruitment and retention of health care volunteers, and providing recognition, awards, appreciation for their services.",
                            "name": "Manage Facility Volunteer Program",
                            "number": "3.2.5",
                            "parent": "Perform Hospital Administration"
                        },
                        {
                            "External ID": "291",
                            "children": [
                                {
                                    "External ID": "267",
                                    "description": "Assign Clinical Tasks is the routing, assignment, delegation and/or transmission of tasks to the appropriate parties, e.g. Daily Staffing Plan. The assignment of tasks will be determined by the health care needs, prioritization, and provider availability in a dynamic environment.",
                                    "name": "Assign Clinical Tasks",
                                    "number": "3.2.6.1",
                                    "parent": "Manage Health Care Resources"
                                },
                                {
                                    "External ID": "270",
                                    "description": "Monitor Clinical Tasks facilitates the monitoring for timely and appropriate completion of each task. In order to reduce the risk of errors during the care process due to missed tasks, the provider is able to view and track un-disposed tasks, current work lists, the status of each task, unassigned tasks or other tasks where a risk of omission exists. The timeliness of certain tasks can be monitored, or reports generated, in accordance with relevant law and accreditation standards.",
                                    "name": "Monitor Clinical Tasks",
                                    "number": "3.2.6.2",
                                    "parent": "Manage Health Care Resources"
                                },
                                {
                                    "External ID": "404",
                                    "description": "Monitor Health Care Workload and Productivity involves compilation of workload statistics and productivity reports.  This includes monitoring of patient acuity and severity to help determine appropriate staffing based on level of experience, organization’s characteristics, and the quality of clinical interaction between and among providers and administrators.  This data is routinely the evidential basis most frequently cited by staff when recommending clinical staffing changes.",
                                    "name": "Monitor Health Care Workload and Productivity",
                                    "number": "3.2.6.3",
                                    "parent": "Manage Health Care Resources"
                                }
                            ],
                            "description": "Manage Health Care Resources provides the current status of health care resources including, but not limited to, available beds, providers, support personnel, ancillary care areas and devices, operating theaters, medical supplies, vaccines, and pharmaceuticals. The intent is to enable the authorized body to distribute or re-distribute either resources or patient load to maximize efficient healthcare delivery.",
                            "name": "Manage Health Care Resources",
                            "number": "3.2.6",
                            "parent": "Perform Hospital Administration"
                        },
                        {
                            "External ID": "768",
                            "description": "Track Location of Patients Receiving Care represents the activities to maintain an up-to-date account of the location of a patient within or between medical treatment facilities. It facilitates positive patient accountability at all times.",
                            "name": "Track Location of Patients Receiving Care",
                            "number": "3.2.7",
                            "parent": "Perform Hospital Administration"
                        },
                        {
                            "External ID": "751",
                            "description": "Post-mortem care includes preparing the body for family viewing, arranging transportation to the morgue, notification of pertinent personnel (MD/MOD, decedent affairs, AOD, escort service, etc.) and determining the disposition of the patient’s belongings.",
                            "name": "Provide Post Mortem Administrative Services",
                            "number": "3.2.8",
                            "parent": "Perform Hospital Administration"
                        }
                    ],
                    "description": "Perform Hospital Administration assures that federal health care resources are expended effectively to ensure quality, safety, and efficiency. This includes managing health care quality, cost, workload, utilization, risk management, and patient safety program. Further it ensures functionality of the hospital, nursing homes, geriatric centers, clinics, and all points of care where VHA is responsible for the execution of health care by integrating people, places, processes and technology.",
                    "name": "Perform Hospital Administration",
                    "number": "3.2",
                    "parent": "Provide Health Care Administration"
                },
                {
                    "External ID": "668",
                    "description": "Provide Library Services involves the acquisition, archival, storage, and preservation of information in the form of books, periodicals, audio, and visual materials in numerous formats in order to allow users to easy access both on a self serve and assisted basis.",
                    "name": "Provide Library Services",
                    "number": "3.3",
                    "parent": "Provide Health Care Administration"
                },
                {
                    "External ID": "290",
                    "children": [
                        {
                            "External ID": "669",
                            "description": "Manage Credentialing and Privileging of Providers involves capturing, verifying and maintaining education history, certification and licensing information for health care provider personnel.  This may include peer review information.",
                            "name": "Manage Credentialing and Privileging of Providers",
                            "number": "3.4.1",
                            "parent": "Maintain Health Care Provider Information"
                        },
                        {
                            "External ID": "48",
                            "description": "Participate in National Practitioner Data Bank (NPDB) Reporting Process provides for the national tracking of  practitioners on whose behalf a malpractice (tort) claim had been paid. The Health Care Quality Improvement Act of 1986 authorized the creation of the National Practitioner Data Bank (NPDB), which is administered by the Department of Health and Human Services.  The Act also mandated that the Department of Health and Human Services enter into a Memorandum of Understanding with VA for the purpose of having VA participate in the NPDB reporting process.",
                            "name": "Participate in National Practitioner Data Bank (NPDB) Reporting Process",
                            "number": "3.4.2",
                            "parent": "Maintain Health Care Provider Information"
                        }
                    ],
                    "description": "Maintain Health Care Provider Information maintains and provides access to current clinical practitioner and provider information.",
                    "name": "Maintain Health Care Provider Information",
                    "number": "3.4",
                    "parent": "Provide Health Care Administration"
                },
                {
                    "External ID": "326",
                    "children": [
                        {
                            "External ID": "330",
                            "description": "Manage Federal and Local Response Plans involves the development, testing, staging, execution and evaluation of response plans in collaboration with the Department of Defense (DoD), Federal Emergency Management Agency (FEMA), and the Department of Health and Human Services (HHS) to assist state and local governments in coping with disasters.  This includes administering the National Disaster Medical System (NMDS),  Federal Response Plan, Federal Radiological Emergency Response Plan related to nuclear hazards.",
                            "name": "Manage Federal and Local Response Plans",
                            "number": "3.5.1",
                            "parent": "Conduct Disaster Preparedness Programs"
                        },
                        {
                            "External ID": "328",
                            "description": "Backup Department of Defense Health Care Resources involves back up DoD’s medical resources following an outbreak of war or other emergencies involving military personnel: provide critical human resources, share medical facilities, share lab services, share pharmacy services, share infrastructure – e.g., next generation health repository",
                            "name": "Backup Department of Defense Health Care Resources",
                            "number": "3.5.2",
                            "parent": "Conduct Disaster Preparedness Programs"
                        },
                        {
                            "External ID": "120",
                            "description": "Provide Emergency Pharmacy Services includes the procurement, storage and maintenance of emergency pharmaceutical, medical and surgical supply items.",
                            "name": "Provide Emergency Pharmacy Services",
                            "number": "3.5.3",
                            "parent": "Conduct Disaster Preparedness Programs"
                        },
                        {
                            "External ID": "327",
                            "description": "Manage the VHA Continuity of Operations Program involves the development, execution and oversight of response programs to be used in case of a disaster affecting internal VHA operations. The program develops response readiness through training, staffing plans, identification of resources, emergency supplies, and infrastructure preparation to ensure the continuity of operations.  This ensures the VACO mandate that all VA organizations use the VA Contingency Plan template (based on the NIST standard) in generating and formatting their contingency plans.",
                            "name": "Manage the VHA Continuity of Operations Program",
                            "number": "3.5.4",
                            "parent": "Conduct Disaster Preparedness Programs"
                        }
                    ],
                    "description": "Conduct Disaster Preparedness Programs encompasses the organization's critical role during natural disasters, and national and local emergencies, and disasters affecting internal operations both as an emergency coordinator and as a health care provider.   It also includes the management of response programs to be used in case of a disaster as well as pre-disaster mitigation efforts to minimize the potential for loss of life and property.  This involves the development of emergency management programs and preparation activities as well as staffing, resources, and equipping regional response centers.",
                    "name": "Conduct Disaster Preparedness Programs",
                    "number": "3.5",
                    "parent": "Provide Health Care Administration"
                },
                {
                    "External ID": "295",
                    "children": [
                        {
                            "External ID": "242",
                            "description": "Develop Medical Policy, Guidelines and Protocols encompasses development and implementation of policies, guidelines, plans, and protocols supporting health care providers in a delivery setting.  These policies, guidelines and protocols may be specific to a site, community, or industry standard.",
                            "name": "Develop Medical Policy, Guidelines, and Protocols",
                            "number": "3.6.1",
                            "parent": "Manage Policy Formulation and Implementation"
                        },
                        {
                            "External ID": "670",
                            "description": "Develop Non-Medical Policy, Guidelines and Protocols encompasses development and implementation of policies, guidelines, plans, and protocols supporting general administrative and operational functions within a health care setting.  These policies, guidelines and protocols may be specific to a site, community, or industry standard.",
                            "name": "Develop Non-Medical Policy, Guidelines and Protocols",
                            "number": "3.6.2",
                            "parent": "Manage Policy Formulation and Implementation"
                        }
                    ],
                    "description": "Manage Policy Formulation and Implementation includes developing effective courses of action to ensure that the policy proposed is valid, efficient, and implementable to the issue at hand. Policy development includes both analytical and political feasibility.",
                    "name": "Manage Policy Formulation and Implementation",
                    "number": "3.6",
                    "parent": "Provide Health Care Administration"
                },
                {
                    "External ID": "293",
                    "children": [
                        {
                            "External ID": "286",
                            "description": "Perform Clinical Process Improvement involves utilization of technology and process reengineering services to streamline or modify existing hospital and clinic processes thereby making them more effective, efficient and responsive.",
                            "name": "Perform Clinical Process Improvement",
                            "number": "3.7.1",
                            "parent": "Manage Clinical Performance"
                        },
                        {
                            "External ID": "671",
                            "description": "Establish Clinical Quality Performance Metrics and Measures involves developing measurable standards and goals, and implementing processes to regularly check progress toward achieving those goals.",
                            "name": "Establish Clinical Quality Performance Metrics and Measures",
                            "number": "3.7.2",
                            "parent": "Manage Clinical Performance"
                        },
                        {
                            "External ID": "759",
                            "description": "Provide Terminology Management involves the governance of the use and application of terminology throughout the health care system.",
                            "name": "Provide Terminology Management",
                            "number": "3.7.3",
                            "parent": "Manage Clinical Performance"
                        },
                        {
                            "External ID": "767",
                            "description": "Monitor Clinical Quality Performance Metrics and Measures performs all operations necessary to capture, track, and report defined metrics and measures.",
                            "name": "Monitor Clinical Quality Performance Metrics and Measures",
                            "number": "3.7.4",
                            "parent": "Manage Clinical Performance"
                        }
                    ],
                    "description": "Manage Clinical Performance involves setting goals and regularly checking progress toward achieving those goals, while routinely monitoring and measuring performance against established quality metrics.  Includes the activities to ensure that goals are consistently being met in an effective and efficient manner.  This process focuses on performance of an organization, a department, an office, etc. and the processes and resources to perform a clinical service.",
                    "name": "Manage Clinical Performance",
                    "number": "3.7",
                    "parent": "Provide Health Care Administration"
                },
                {
                    "External ID": "672",
                    "description": "Manage Customer Relations involves implementing and controlling all aspects of Customer Relationship Management (CRM) as it pertains to the relationships between the organization and its primary customers which include patients, organizations, and public or private entities that support health care delivery to patients. This includes establishing processes and activities in order to support and enhance Patient and Customer service satisfaction goals and objectives. CRM is routinely utilized both before and after a product or service is offered.",
                    "name": "Manage Customer Relations",
                    "number": "3.8",
                    "parent": "Provide Health Care Administration"
                },
                {
                    "External ID": "29",
                    "description": "Coordinate Pre-Auth and Pre-Cert and Insurance Processing refer to the process by which a patient is pre-approved for coverage of a specific medical procedure or prescription drug prior to receiving the procedure or the medication. The insurance company will generally require that the patient's doctor submit notes and/or lab results documenting the patient's condition and treatment history.  Insurance processing includes insurance verification, billing, utilization review and accounts receivable follow-up.",
                    "name": "Coordinate Pre-Auth, Pre-Cert and Insurance Processing",
                    "number": "3.9",
                    "parent": "Provide Health Care Administration"
                }
            ],
            "description": "Provide Health Care Administration assures that federal health care resources are expended effectively to ensure quality, safety, and efficiency. This includes managing health care quality, cost, workload, and utilization.",
            "name": "Provide Health Care Administration",
            "number": "3.0",
            "parent": "The Health Care Segment"
        },
        {
            "External ID": "46",
            "children": [
                {
                    "External ID": "54",
                    "description": "Provide Complementary and Alternative Medicine (CAM) delivers medical intervention, health promotion, or disease prevention through means which may not be taught at United States medical schools, nor routinely underwritten by third party payers within the existing United States health care system.  Examples include acupuncture, or chiropractic care.",
                    "name": "Provide Complementary and Alternative Medicine",
                    "number": "4.1",
                    "parent": "Deliver Health Care"
                },
                {
                    "External ID": "124",
                    "children": [
                        {
                            "External ID": "125",
                            "description": "Manage Prosthetic Clinical Program is coordinating the development of clinical practice recommendations that will enhance the appropriate use of prosthetic devices. It also promotes a uniform prosthetic clinical practice and includes coordinating contracting opportunities to assure technology uniformity and ease of access to prosthetic prescriptions and patient care.",
                            "name": "Manage Prosthetic Clinical Program",
                            "number": "4.10.1",
                            "parent": "Provide Prosthetics and Sensory Aids"
                        },
                        {
                            "External ID": "126",
                            "description": "Provide Prosthetic and Orthotic Lab Services is planning, developing and executing the VHA delivery system for prosthetic and orthotic appliances, devices and related services.",
                            "name": "Provide Prosthetic and Orthotic Lab Services",
                            "number": "4.10.2",
                            "parent": "Provide Prosthetics and Sensory Aids"
                        },
                        {
                            "External ID": "44",
                            "description": "Provide Prosthetic Devices provides specialized patient care by furnishing properly prescribed prosthetic equipment, sensory aids and devices in the most economical and timely manner in accordance with authorizing laws, regulations and policies.  Serves as the pharmacy for assistive aids and as case manager for prosthetic equipment needs of the disabled Veteran.",
                            "name": "Provide Prosthetic Devices",
                            "number": "4.10.3",
                            "parent": "Provide Prosthetics and Sensory Aids"
                        },
                        {
                            "External ID": "127",
                            "description": "Manage National Prosthetic Program includes planning, developing, administering, and implementing national policies and procedures governing comprehensive National Prosthetic Programs for assigned networks and territories, including oversight to ensure follow-through has occurred down to the local level.",
                            "name": "Manage National Prosthetic Program",
                            "number": "4.10.4",
                            "parent": "Provide Prosthetics and Sensory Aids"
                        }
                    ],
                    "description": "Provide Prosthetics and Sensory Aids Services focuses on providing specialized quality patient care by furnishing properly prescribed prosthetic equipment, sensory aids and devices in the most economical and timely manner in accordance with authorizing laws, regulations, and policies.  Prosthetics serves as the pharmacy for assistive aids and as case manager for prosthetic equipment needs of the disabled Veteran.  Prosthetics procures items for individual patients.",
                    "name": "Provide Prosthetics and Sensory Aids",
                    "number": "4.10",
                    "parent": "Deliver Health Care"
                },
                {
                    "External ID": "182",
                    "children": [
                        {
                            "External ID": "186",
                            "description": "Develop Patient Summary Record of Care is obtaining and producing a historical summary of patient illnesses, medical diagnoses, surgeries and other procedures performed on the patient, and relevant health conditions of family members captured through such methods as patient reporting (for example interview, medical alert band) or electronic or non-electronic historical data. When first seen by a health care provider, patients typically bring with them clinical information from past encounters. This and similar information is captured and presented alongside locally captured documentation and notes wherever appropriate.",
                            "name": "Develop Patient Summary Record of Care",
                            "number": "4.11.1",
                            "parent": "Manage Health Records"
                        },
                        {
                            "External ID": "190",
                            "description": "Obtain Patient Preferences and Directives is recording patient and family preferences, obtaining patient advance directives, consents and authorizations.  This function includes capturing or receiving information on potential donors and recipients (for products such as blood, organs, tissue or other biological items).  The user can make this information available to internal and external donor matching agencies.",
                            "name": "Obtain Patient Preferences and Directives",
                            "number": "4.11.10",
                            "parent": "Manage Health Records"
                        },
                        {
                            "External ID": "184",
                            "description": "Capture Patient Demographics is maintaining basic contact information as well as key demographic information such as date of birth, time of birth, gestation, and gender.  Information is stored and maintained for unique patient identification, reporting purposes and for the provision of care. Patient demographics are captured and maintained as discrete fields (e.g., patient names and addresses) and may be enumerated, numeric or codified.",
                            "name": "Capture Patient Demographics",
                            "number": "4.11.2",
                            "parent": "Manage Health Records"
                        },
                        {
                            "External ID": "686",
                            "description": "Track Incomplete Records ensures that medical protocols are followed and medical procedures are prescribed and accomplished in a timely manner by examining the stages of completion of applicable medical records.",
                            "name": "Track Incomplete Records",
                            "number": "4.11.3",
                            "parent": "Manage Health Records"
                        },
                        {
                            "External ID": "188",
                            "description": "Record Patient History records the history of the current illness and reviews the patient's historical data related to previous medical diagnoses, surgeries and other procedures performed on the patient. It also includes relevant health conditions of family members. This information is captured through such methods as patient reporting (for example interview, medical alert band) or electronic or non-electronic historical data.  Patient provided clinical history and similar information is captured and presented alongside locally captured documentation and notes wherever appropriate.",
                            "name": "Record Patient History",
                            "number": "4.11.4",
                            "parent": "Manage Health Records"
                        },
                        {
                            "External ID": "185",
                            "description": "Capture Data and Documentation from External Sources captures patient data and documentation from external sources including patient generated data, clinical, administrative, and financial information systems, other Electronic Health Record (EHR) systems, Personal Health Record (PHR) systems, and data received through health information exchange networks.  This may involve contacting other providers or medical facilities including laboratories and radiologists to get relevant patient medical care information.",
                            "name": "Capture Data and Documentation from External Sources",
                            "number": "4.11.5",
                            "parent": "Manage Health Records"
                        },
                        {
                            "External ID": "205",
                            "description": "Capture Patient Care Encounter Information documents data resulting from ambulatory care patient encounters.  Documented information includes problems treated at encounter, procedures done, immunizations, patient instructions and education.",
                            "name": "Capture Patient Care Encounter Information",
                            "number": "4.11.6",
                            "parent": "Manage Health Records"
                        },
                        {
                            "External ID": "201",
                            "description": "Manage Notes includes creation and editing of all notes associated with a patient's health care record.",
                            "name": "Manage Notes",
                            "number": "4.11.7",
                            "parent": "Manage Health Records"
                        },
                        {
                            "External ID": "194",
                            "description": "Maintain Patient Summary Lists involves the management and maintenance of a patient's Allergy, Intolerance and Adverse Reaction, Medication, Problem, Immunization, or any other applicable list over the course of a visit or the lifetime of the patient. It includes documenting all pertinent dates, modifications, dosages, intolerances, side effects or other adverse reactions to drugs, chronic conditions, diagnoses, etc. inside of the patient's health record. Maintaining summary lists of patient medications is a key function when performing medication reconciliation for a patient.",
                            "name": "Maintain Patient Summary Lists",
                            "number": "4.11.8",
                            "parent": "Manage Health Records"
                        },
                        {
                            "External ID": "28",
                            "description": "Manage Referrals involves managing patient referrals. It addresses enabling the origination, the documentation and monitoring of referrals between care providers or health care organizations, including clinical and administrative details of the referral, and also the consents and authorizations for disclosures as required.",
                            "name": "Manage Referrals",
                            "number": "4.11.9",
                            "parent": "Manage Health Records"
                        }
                    ],
                    "description": "Manage Health Records manages patient health records, including longitudinal and point of care records. This includes functions that address the mechanics of developing a health record and concepts such as a single logical health record, managing patient demographics, and managing externally generated (including patient generated) health data. This component focuses on functions to create, modify, authenticate and retire, as needed, transcribed or directly-entered clinical documentation and notes.",
                    "name": "Manage Health Records",
                    "number": "4.11",
                    "parent": "Deliver Health Care"
                },
                {
                    "External ID": "246",
                    "children": [
                        {
                            "External ID": "37",
                            "description": "Provide Patient Care Education provides the patient appropriate, personalized, safe and effective education on matters involving the patient's condition, medications, risks and instructions for self-care. Multiple modalities may be utilized in providing reliable information regarding wellness, preventive care, disease management, treatments, peer support groups and other relevant information.",
                            "name": "Provide Patient Care Education",
                            "number": "4.2.1",
                            "parent": "Provide Care Support Education"
                        },
                        {
                            "External ID": "673",
                            "description": "Provide Family Education provides the patient's family member or responsible caregiver reliable information  about wellness, prevention, disease management, treatments, peer support groups and related information that is relevant for a specific patient's condition.\"  Also, add the following to the Commentary column: \"May include pamphlets, online resources, MyHealthEvet, portals, mobile apps and so forth.",
                            "name": "Provide Family Education",
                            "number": "4.2.2",
                            "parent": "Provide Care Support Education"
                        }
                    ],
                    "description": "Provide Care Support Education utilizes disease self-management strategies in  combination with multiple modalities to provide education in support of care for Veterans. These services are patient-centered, supported by licensed care coordinators, and have a focus on patient self-management. Goals include the medical, functional, psychosocial, and spiritual needs of the patient and family. Program staff work closely with the patient, their families and other caregivers to contribute to knowledge regarding the patient's health condition.",
                    "name": "Provide Care Support Education",
                    "number": "4.2",
                    "parent": "Deliver Health Care"
                },
                {
                    "External ID": "235",
                    "children": [
                        {
                            "External ID": "257",
                            "description": "Deliver Alerts for Patient Care focuses on generating alerts for preventive care, wellness care, medication administration or other activities at the time of the encounter. These alerts may include medication and immunization alerts that help to minimize potential administration or medication errors (such as wrong patient, wrong drug, wrong dose, wrong route and wrong time as well as potential negative drug-drug interactions). These alerts may also include screening exams, lab tests and so forth, and are based on national protocols. Alerts generated while updating patient medication lists are a key function when performing medication reconciliation.",
                            "name": "Deliver Alerts for Patient Care",
                            "number": "4.3.1",
                            "parent": "Provide Clinical Decision Support"
                        },
                        {
                            "External ID": "216",
                            "description": "Monitor Documentation of Clinician Response to Decision Support Prompts provides support for the review and documentation concerning the utilization of clinical decision-support prompts at the patient level; it also aggregates data for organizational trending.",
                            "name": "Monitor Documentation of Clinician Response to Decision Support Prompts",
                            "number": "4.3.2",
                            "parent": "Provide Clinical Decision Support"
                        },
                        {
                            "External ID": "122",
                            "description": "Provide Medication Order Checks identifies potential adverse drug events (ADEs). It does this by comparing medications ordered against information in the patient’s health record (allergies and current medication lists) and clinical data stores of medication information (drug-drug interactions, drug allergies, etc.), diagnoses and lab values. When potential ADEs are identified, alerts or notifications are generated that force a clinician to stop and modify the order or acknowledge the potential ADE before continuing. Medication order checks are provided at ordering, in pharmacy, at administration and during medication reconciliation.",
                            "name": "Provide Medication Order Checks",
                            "number": "4.3.3",
                            "parent": "Provide Clinical Decision Support"
                        },
                        {
                            "External ID": "264",
                            "description": "Provide Health Care Guidance for Providers offers providers the option to access current evidence-based knowledge guidelines at the point of care. This may include links to websites or intranet sites.",
                            "name": "Provide Healthcare Guidance for Providers",
                            "number": "4.3.4",
                            "parent": "Provide Clinical Decision Support"
                        }
                    ],
                    "description": "Provide Clinical Decision Support augments clinical decision-making by providing health care professionals with knowledge-enriched, disease-specific recommendations for treatments, tests and referrals based on individual patient profiles.  It also includes the ability to identify potential problems or trends within the patient community. This function leverages coded clinical data, global medical knowledge and institutional protocols.",
                    "name": "Provide Clinical Decision Support",
                    "number": "4.3",
                    "parent": "Deliver Health Care"
                },
                {
                    "External ID": "146",
                    "children": [
                        {
                            "External ID": "262",
                            "description": "Monitor and Follow-up on Patients Health Status and Outcomes utilizes results from Preventive Services and Wellness Reminders to monitor and follow up the health status of the patient. Reminders may be customized at specific time intervals or be disease-specific to allow provider close monitoring.",
                            "name": "Monitor and Follow-up on Patients Health Status and Outcomes",
                            "number": "4.4.1",
                            "parent": "Provide Care Management"
                        },
                        {
                            "External ID": "51",
                            "description": "Provide Care Coordination coordinates patient care activities between two or more participants (including the patient) involved in a patient's care to facilitate the appropriate delivery of health care services. It is the marshaling of personnel and other resources needed to carry out all required patient care activities, and is often managed by the exchange of information among participants responsible for different aspects of care.  Also occurs in an inpatient setting.",
                            "name": "Provide Care Coordination",
                            "number": "4.4.2",
                            "parent": "Provide Care Management"
                        },
                        {
                            "External ID": "212",
                            "description": "Manage Patient's Immunizations Schedule follows Center for Disease Control (CDC) guidelines for immunizations and industry standard protocols. For example, a schedule for an infant will have different content than one for an elderly patient. When a specific standard schedule does not exist, a unique schedule can be developed, using the format and data elements of a similar standard schedule, whenever possible.",
                            "name": "Manage Patient's Immunizations Schedule",
                            "number": "4.4.3",
                            "parent": "Provide Care Management"
                        },
                        {
                            "External ID": "258",
                            "description": "Provide Reminders for Preventative Care involves notifying patients of preventive services, tests or behavioral actions that are due or overdue. This may include lab testing, follow-up appointments or other exams and tests.",
                            "name": "Provide Reminders for Preventative Care",
                            "number": "4.4.4",
                            "parent": "Provide Care Management"
                        },
                        {
                            "External ID": "754",
                            "description": "Provide Treatment Plans involves developing treatment plans based on an individual's diagnosis. Treatment Planning leverages guidelines, protocols, disease management strategies, and research materials to determine the most appropriate intervention.",
                            "name": "Provide Treatment Plans",
                            "number": "4.4.5",
                            "parent": "Provide Care Management"
                        },
                        {
                            "External ID": "755",
                            "description": "Provide Case Management develops individualized, issue-focused plans of health service that utilize the appropriate level of care and resources to ensure quality and cost-effective outcomes. All plans of health service will incorporate care management, case management, wellness, and disease management strategies.",
                            "name": "Provide Case Management",
                            "number": "4.4.6",
                            "parent": "Provide Care Management"
                        }
                    ],
                    "description": "Provide Care Management develops individualized, issue-focused plans of care that utilize the appropriate level of care and resources to ensure quality and cost-effective outcomes. All plans of care will incorporate care management, case management, wellness, and disease management strategies.",
                    "name": "Provide Care Management",
                    "number": "4.4",
                    "parent": "Deliver Health Care"
                },
                {
                    "External ID": "56",
                    "children": [
                        {
                            "External ID": "57",
                            "description": "Advise Oral Health Field helps the Office of Dentistry shape policy, develop initiatives and act as a conduit for bringing field concerns forward. The Oral Health Field Advisory Group consists of dental leaders from across the country experienced in the process of providing care to our Veteran patients.",
                            "name": "Advise Oral Health Field",
                            "number": "4.5.1",
                            "parent": "Provide Dentistry"
                        },
                        {
                            "External ID": "58",
                            "description": "Provide Dental Prosthetic Services is the provision of Dental Prosthetic Services for Dental Clinics.",
                            "name": "Provide Dental Prosthetic Services",
                            "number": "4.5.2",
                            "parent": "Provide Dentistry"
                        },
                        {
                            "External ID": "61",
                            "description": "Provide Dental Care Services is the provision of dental care in modern clinics that adhere to the highest standards of hygiene and infection control. A full range of services is offered to eligible patients, including: regularly scheduled cleaning and X-rays, restorative procedures such as fillings, crowns and bridges, dentures, oral surgery, access to oral and facial reconstruction surgery resulting from trauma or serious illness.  This function also includes providing dental care services to homeless Veterans through the Homeless Veterans Dental Program.",
                            "name": "Provide Dental Care Services",
                            "number": "4.5.3",
                            "parent": "Provide Dentistry"
                        }
                    ],
                    "description": "Provide Dentistry is the provision of dental care. Dentistry develops and disseminates programmatic policy and operational plans for dentistry's mission, and provides administrative guidance for the integration of dental programs with the primary objectives of high quality patient care delivered in the most competitive manner possible. VHA Dentistry also serves as a back-up to military medicine in time of national emergency and develops sharing agreements with other outside agencies to decrease cost and improve services.",
                    "name": "Provide Dentistry",
                    "number": "4.5",
                    "parent": "Deliver Health Care"
                },
                {
                    "External ID": "176",
                    "description": "Provide Nursing Services integrates a wide array of services, encompassing patient care (assess, plan, implement and evaluate care), clinical practice, education, research and administration.",
                    "name": "Provide Nursing Services",
                    "number": "4.6",
                    "parent": "Deliver Health Care"
                },
                {
                    "External ID": "97",
                    "children": [
                        {
                            "External ID": "259",
                            "children": [
                                {
                                    "External ID": "200",
                                    "description": "Provide Patient Assessments includes conducting an assessment to analyze problem(s) that the patient is presenting or the provider uncovers during the encounter.  The assessment considers the age, gender, developmental or functional state, medical and behavioral condition of the patient, such as growth charts, developmental profiles, and disease specific assessments.",
                                    "name": "Provide Patient Assessments",
                                    "number": "4.7.1.1",
                                    "parent": "Perform Patient Care Encounter"
                                },
                                {
                                    "External ID": "238",
                                    "description": "Evaluate Health Status and Determine Risks uses an issues-based approach to analyze the beneficiary's health, functional and risk status. Evaluating health status is both on-going and episodic. The health risk assessment tool is a standardized set of health questions completed by each beneficiary on entry, and risk level is determined by population health studies.",
                                    "name": "Evaluate Health Status and Determine Risks",
                                    "number": "4.7.1.2",
                                    "parent": "Perform Patient Care Encounter"
                                },
                                {
                                    "External ID": "674",
                                    "description": "Determine Allergies and Adverse Reactions involves using diagnostic tests to accurately diagnose patient allergies symptoms and  monitor adverse reactions to medications or procedures.",
                                    "name": "Determine Allergies and Adverse Reactions",
                                    "number": "4.7.1.3",
                                    "parent": "Perform Patient Care Encounter"
                                },
                                {
                                    "External ID": "766",
                                    "description": "Communicate Diagnostic Results to Patient is performed by providers when diagnostic results are delivered by ancillary services directly to the provider as an intermediary. This business function allows the provider to optionally convey medical context to the results.",
                                    "name": "Communicate Diagnostic Results to Patient",
                                    "number": "4.7.1.4",
                                    "parent": "Perform Patient Care Encounter"
                                }
                            ],
                            "description": "Perform Patient Care Encounter is the interaction between a patient and a provider for the purpose of diagnosis and/or treatment of an illness or injury. All patient encounters must be recorded in the patient’s health record.",
                            "name": "Perform Patient Care Encounter",
                            "number": "4.7.1",
                            "parent": "Provide Medical Services"
                        },
                        {
                            "External ID": "753",
                            "description": "Provide Emergency Health Care includes providing rapid and varied medical services, primarily for patients who are stricken with sudden and acute illness or who are the victims of severe trauma. This function includes triage  services and acuity determination.",
                            "name": "Provide Emergency Health Care",
                            "number": "4.7.10",
                            "parent": "Provide Medical Services"
                        },
                        {
                            "External ID": "129",
                            "description": "Provide Primary Care is the provision of services by providers who act as the principal point of consultation for patients within a health care system. It provides Veteran patients with the continuum of care to promote their health and well-being, prevent disease, receive treatment for existing acute illnesses, recover function to its highest level and utilize long-term care when it is needed. This activity also includes: outpatient substance abuse treatment and the documentation and monitoring of referrals between care providers or health care organizations, including clinical and administrative details of the referral.",
                            "name": "Provide Primary Care",
                            "number": "4.7.2",
                            "parent": "Provide Medical Services"
                        },
                        {
                            "External ID": "85",
                            "description": "Provide Specialty Care augments the primary care provider with the diagnosis, initiation or alteration of treatment strategies within defined clinical specialty areas. These specialty care services can be performed in an outpatient or inpatient setting.",
                            "name": "Provide Specialty Care",
                            "number": "4.7.3",
                            "parent": "Provide Medical Services"
                        },
                        {
                            "External ID": "153",
                            "description": "Provide Surgery is a medical specialty that uses operative manual and instrumental techniques on a patient (inpatient or outpatient), to investigate and/or treat a pathological condition such as disease or injury, and to help improve bodily function or appearance.",
                            "name": "Provide Surgery",
                            "number": "4.7.4",
                            "parent": "Provide Medical Services"
                        },
                        {
                            "External ID": "77",
                            "children": [
                                {
                                    "External ID": "80",
                                    "description": "Provide Mental Health Residential Rehabilitation and Treatment  focuses on residential rehabilitative and clinical treatment for Veterans who have a wide range of problems, illnesses, or rehabilitative care needs. These can be medical, psychiatric, vocational, educational, and social and could be related to Substance Use Disorder (SUD), homelessness and other conditions or problems. The term Mental Health Residential Rehabilitation Treatment Programs (MH RRTP) is used to refer to those facilities currently designated as Psycho-social Residential Rehabilitation Treatment Programs (PRRTPs), Post-Traumatic Stress Disorder Residential Rehabilitation Treatment Programs (PTSD-RRTPs), Substance Abuse Residential Rehabilitation Treatment Programs (SARRTPs), and Compensated Work Therapy (CWT)-Transitional Residence (TRs), as well as Domiciliaries, also designated as Domiciliary Residential Rehabilitation Treatment Programs (DRRTPs), and Domiciliary Care for Homeless Veterans (DCHVs). Although these programs have different histories and different eligibility policies, the clinical policies and clinical practices are identical.",
                                    "name": "Provide Mental Health Residential Rehabilitation and Treatment",
                                    "number": "4.7.5.1",
                                    "parent": "Provide Mental Health Services"
                                },
                                {
                                    "External ID": "675",
                                    "description": "Provide Evidence-Based Psychotherapy (EBP) focuses on specific psychotherapies, or \"Talk Therapies\" that have repeatedly been shown in clinical research to be effective for a particular mental health condition or conditions such as depression, anxiety and substance use disorders.  In addition, EBPs have also been shown to be effective for several physical health related conditions and behaviors; things such as chronic pain, insomnia or sleep disturbance.   VA Psychotherapies include Cognitive Processing Therapy and/or Prolonged Exposure Therapy for PTSD and Social Skills Training for Serious Mental Illness along with Acceptance and Commitment Therapy, Cognitive Behavioral Therapy, and/or Interpersonal Therapy for depression.",
                                    "name": "Provide Evidence-Based Psychotherapy (EBP)",
                                    "number": "4.7.5.2",
                                    "parent": "Provide Mental Health Services"
                                },
                                {
                                    "External ID": "79",
                                    "description": "Provide Psychosocial Rehabilitation and Recovery Treatment  provides a therapeutic and supportive learning environment for Veterans to achieve recovery to the fullest extent possible.   Treatment includes family education programs, social skills training, education groups, illness management and recovery,  wellness programs and peer support services.  Psychosocial Rehabilitation and Recovery is an ambulatory, not residential, service.",
                                    "name": "Provide Psychosocial Rehabilitation and Recovery Treatment",
                                    "number": "4.7.5.3",
                                    "parent": "Provide Mental Health Services"
                                },
                                {
                                    "External ID": "81",
                                    "description": "Provide Post Traumatic Stress Disorder (PTSD) Care focuses on cognitive behavioral treatments that typically encompass a number of components, including psychoeducation, anxiety management, exposure, and cognitive restructuring. Exposure and cognitive restructuring are thought to be the most effective components.",
                                    "name": "Provide Post Traumatic Stress Disorder (PTSD) Care",
                                    "number": "4.7.5.4",
                                    "parent": "Provide Mental Health Services"
                                },
                                {
                                    "External ID": "82",
                                    "description": "Provide Mental Health Informatics Analysis provides information to clinicians by completing structured assessments and interviews of behavioral health treatment plans and delivery.",
                                    "name": "Provide Mental Health Informatics Analysis",
                                    "number": "4.7.5.5",
                                    "parent": "Provide Mental Health Services"
                                },
                                {
                                    "External ID": "84",
                                    "description": "Provide Geropsychiatry Treatment treats mental illness in the elderly utilizing an interdisciplinary team. This specialized treatment is offered for patients with conditions such as dementia, utilizing the latest technology to promote patient safety in a restraint-free environment.",
                                    "name": "Provide Geropsychiatry Treatment",
                                    "number": "4.7.5.6",
                                    "parent": "Provide Mental Health Services"
                                },
                                {
                                    "External ID": "35",
                                    "description": "Provide Veteran Readjustment Counseling delivers specific readjustment counseling and outreach services to all Veterans, and their families, particularly those who served in any combat zone.",
                                    "name": "Provide Veteran Readjustment Counseling",
                                    "number": "4.7.5.7",
                                    "parent": "Provide Mental Health Services"
                                }
                            ],
                            "description": "Provide Mental Health Services (also known as behavioral health) generally includes inpatient and outpatient behavioral health services, prevention, treatment, and rehabilitation services to promote mental health, treat substance abuse, reduce illness, death, disability, and associated health care costs.",
                            "name": "Provide Mental Health Services",
                            "number": "4.7.5",
                            "parent": "Provide Medical Services"
                        },
                        {
                            "External ID": "206",
                            "children": [
                                {
                                    "External ID": "208",
                                    "description": "Create Orders brings a new order into being.  It includes all checks and authorizations, including signing and validating the order, needed to produce a valid order that can be released to parties that are intended to fulfill the order.",
                                    "name": "Create Orders",
                                    "number": "4.7.6.1",
                                    "parent": "Manage Orders"
                                },
                                {
                                    "External ID": "676",
                                    "description": "Change Orders enables the order requester, or authorized agent, to update parameters of existing orders or to cancel orders. Change orders includes signing and validating the order.",
                                    "name": "Change Orders",
                                    "number": "4.7.6.2",
                                    "parent": "Manage Orders"
                                },
                                {
                                    "External ID": "213",
                                    "description": "Track Orders follows the course or pathway of an order or a set of orders. This enables the viewing of order histories and fulfillment states. This also enables fulfillment parties to convey changes to the fulfillment state of an order.",
                                    "name": "Track Orders",
                                    "number": "4.7.6.3",
                                    "parent": "Manage Orders"
                                },
                                {
                                    "External ID": "769",
                                    "description": "Administer Order Sets manages the sets of standard orders to be used throughout VHA, including combined sets of orders.",
                                    "name": "Administer Order Sets",
                                    "number": "4.7.6.4",
                                    "parent": "Manage Orders"
                                }
                            ],
                            "description": "Manage Orders encompasses the management of Clinical and Non-Medication Orders. Orders support inpatient, outpatient, and prescription scenarios.",
                            "name": "Manage Orders",
                            "number": "4.7.6",
                            "parent": "Provide Medical Services"
                        },
                        {
                            "External ID": "677",
                            "description": "Perform Compensation and Pension Medical Examinations performs a medical examination requested by the VBA and performed by a Veterans Health Administration (VHA) or contractor clinician. The reports of these examinations become part of the medical evidence that VBA’s raters use to evaluate the degree of disability of the Veteran.",
                            "name": "Perform Compensation and Pension Medical Examinations",
                            "number": "4.7.7",
                            "parent": "Provide Medical Services"
                        },
                        {
                            "External ID": "211",
                            "description": "Administer Medication ensures medication is administered appropriately to the patient.  A qualified clinician will use information such as the list of medication orders that are to be administered, administration instructions, times or other conditions of administration, dose and route, etc. for a specific patient.  The provider will also record what actually was or was not administered, and whether or not these facts conform to the order.",
                            "name": "Administer Medication",
                            "number": "4.7.8",
                            "parent": "Provide Medical Services"
                        },
                        {
                            "External ID": "215",
                            "description": "Monitor Patient Clinical Measurements is the capturing and maintenance of patient vital signs, lab results, medications, immunizations, other test results to be used in determining a plan of care for the patient. This also includes the monitoring of patient oral fluids, IV fluids, as well as medications, monitoring diagnostic procedures, and documenting output from patient. This information is used for clinical evaluation and management.",
                            "name": "Monitor Patient Clinical Measurements",
                            "number": "4.7.9",
                            "parent": "Provide Medical Services"
                        }
                    ],
                    "description": "Provide Medical Services delivers primary and specialty care services to maintain and restore patient health by preventing and treating illness.",
                    "name": "Provide Medical Services",
                    "number": "4.7",
                    "parent": "Deliver Health Care"
                },
                {
                    "External ID": "64",
                    "children": [
                        {
                            "External ID": "66",
                            "children": [
                                {
                                    "External ID": "69",
                                    "description": "Interpret Radiological Image involves reviewing and analyzing an image in order to determine a disposition and/or diagnosis. Interpretations are communicated to the physician who ordered the procedure.",
                                    "name": "Interpret Radiological Image",
                                    "number": "4.8.1.1",
                                    "parent": "Provide Radiology Services"
                                },
                                {
                                    "External ID": "70",
                                    "description": "Administer Radiological Treatment involves the use of radiation therapy or Nuclear Medicines for the treatment of disease.",
                                    "name": "Administer Radiological Treatment",
                                    "number": "4.8.1.2",
                                    "parent": "Provide Radiology Services"
                                }
                            ],
                            "description": "Provide Radiology Services involves the interpretation of medical images to diagnose ailments, as well as the use of ionizing and nonionizing radiation to treat disease.",
                            "name": "Provide Radiology Services",
                            "number": "4.8.1",
                            "parent": "Provide Ancillary Services"
                        },
                        {
                            "External ID": "134",
                            "description": "Provide Rehabilitation Services provides the full range of rehabilitative care including Physical Medicine and Rehabilitation, Polytrauma, Traumatic Brain Injury, Blind Rehabilitation, Audiology and Speech Pathology, and Recreation Therapy.",
                            "name": "Provide Rehabilitation Services",
                            "number": "4.8.10",
                            "parent": "Provide Ancillary Services"
                        },
                        {
                            "External ID": "681",
                            "description": "Provide Social Work Services focuses on developing and implementing treatment approaches which address individual social problems and work with acute and chronic medical conditions, dying patients, and bereaved families. This includes ensuring continuity of care through the admission, evaluation, treatment, and follow-up processes.  Activities also include coordinating discharge planning and providing case management services based on the patients clinical and community health and social services resources. Social Work Services helps patients and families to achieve their highest level of adjustment to society, promoting vocational and psychosocial rehabilitation.",
                            "name": "Provide Social Work Services",
                            "number": "4.8.11",
                            "parent": "Provide Ancillary Services"
                        },
                        {
                            "External ID": "94",
                            "description": "Provide Chaplain Services ensures appropriate spiritual, emotional and pastoral care to patients, family and staff. This may include grief counseling, end of life counseling, family crisis counseling or counseling for other spiritual needs.",
                            "name": "Provide Chaplain Services",
                            "number": "4.8.12",
                            "parent": "Provide Ancillary Services"
                        },
                        {
                            "External ID": "683",
                            "children": [
                                {
                                    "External ID": "68",
                                    "description": "Capture Image involves creating diagnostic quality visual representations of a body. It also includes preparing the patient for optimized images.",
                                    "name": "Capture Image",
                                    "number": "4.8.13.1",
                                    "parent": "Provide Imaging Services"
                                },
                                {
                                    "External ID": "684",
                                    "description": "Manage Images involves the storage, display, and transmission of medical images from one location to another.",
                                    "name": "Manage Images",
                                    "number": "4.8.13.2",
                                    "parent": "Provide Imaging Services"
                                }
                            ],
                            "description": "Provide Imaging Services involves the capture (to include MRI, CT, Ultrasound, X-rays, photos, etc.), storage, display, and transmission of medical images from one location to another for clinical analysis, diagnosis, and medical intervention.",
                            "name": "Provide Imaging Services",
                            "number": "4.8.13",
                            "parent": "Provide Ancillary Services"
                        },
                        {
                            "External ID": "62",
                            "description": "Provide General Laboratory Services establishes and provides laboratory medicine in such areas as chemistry, hematology, microbiology, histology and cytogenetics. This includes setting the standards for quality, test methods and procedures.",
                            "name": "Provide General Laboratory Services",
                            "number": "4.8.2",
                            "parent": "Provide Ancillary Services"
                        },
                        {
                            "External ID": "678",
                            "description": "Provide Pathology Services is a medical specialty that is concerned with the diagnosis of disease based on the gross, microscopic, chemical, immunologic and molecular examination of organs, tissues, and whole bodies.  It includes Anatomic Pathology, Clinical Pathology, Electron Microscopy, Surgical Pathology, Toxicology, Cytopathology, and Autopsy.",
                            "name": "Provide Pathology Services",
                            "number": "4.8.3",
                            "parent": "Provide Ancillary Services"
                        },
                        {
                            "External ID": "645",
                            "description": "Provide Blood Services is the management of acquiring, receiving, storing, controlling, distributing, maintaining, preparing and disposing of blood and blood products.  This includes obtaining products from external sources.",
                            "name": "Provide Blood Services",
                            "number": "4.8.4",
                            "parent": "Provide Ancillary Services"
                        },
                        {
                            "External ID": "758",
                            "description": "Provide Non-Blood Services is the management of acquiring, receiving, storing, controlling, distributing, maintaining, preparing and disposing of other biologic products.",
                            "name": "Provide Non-Blood Services",
                            "number": "4.8.5",
                            "parent": "Provide Ancillary Services"
                        },
                        {
                            "External ID": "116",
                            "children": [
                                {
                                    "External ID": "121",
                                    "description": "Manage the National Formulary includes surveying medical literature for updates and providing feedback to VISNs regarding action taken on requests for additions or deletions to the National Formulary. It also involves developing guidelines on the pharmacologic management of common and/or high cost disease states and disseminating draft guidelines for peer review and making periodic updates through continuous review of new information from well-designed, scientifically valid studies and outcome data.",
                                    "name": "Manage the National Formulary",
                                    "number": "4.8.6.1",
                                    "parent": "Provide Pharmacy Services"
                                },
                                {
                                    "External ID": "123",
                                    "description": "Provide Inpatient Pharmacy Services is the provision of Inpatient Pharmacy Services. These services are provided to hospitalized Veterans at medical centers or clinics across the country.  Most facilities' inpatient pharmacy services are offered 24 hours a day, 365 days a year.  Key activities include direct and indirect patient medication counseling, education, clinical pharmacist activities as a component of the interdisciplinary health care team.",
                                    "name": "Provide Inpatient Pharmacy Services",
                                    "number": "4.8.6.2",
                                    "parent": "Provide Pharmacy Services"
                                },
                                {
                                    "External ID": "679",
                                    "description": "Provide Outpatient Pharmacy Services is the handling and dispensing of drugs and supplies to outpatients (including via consolidated mail outpatient service).  Key activities include direct and indirect patient medication counseling, education, drug and supply dispensing services, clinical pharmacist activities as a component of the interdisciplinary health care team and arranging for emergency prescription services through a community pharmacy or the Fee Basis program.",
                                    "name": "Provide Outpatient Pharmacy Services",
                                    "number": "4.8.6.3",
                                    "parent": "Provide Pharmacy Services"
                                },
                                {
                                    "External ID": "334",
                                    "description": "Maintain Pharmacy Inventory is managing a perpetual inventory of drugs and supplies by monitoring  distribution and inventory management within a health care facility.  It provides the capability for Pharmacy personnel to display or print procurement history, drug balance adjustments, and order data. Drugs and supplies can be automatically traced, inventoried and delivered to an area of use (wards, clinics, and specialties) or requested on demand.",
                                    "name": "Maintain Pharmacy Inventory",
                                    "number": "4.8.6.4",
                                    "parent": "Provide Pharmacy Services"
                                },
                                {
                                    "External ID": "118",
                                    "description": "Provide Consolidated Mail Outpatient Pharmacy Services are provided through designated VA  facilities that constitute the National VA Consolidated Mail Outpatient Pharmacy (CMOP) Network providing interactive pharmaceutical support services to VA health care facilities located within defined CMOP service areas throughout the U.S. CMOP provides the means to dispense via mail, prescriptions to eligible Veterans to ensure that each Veteran receives their prescriptions in the most timely, accurate and cost effective manner possible.",
                                    "name": "Provide Consolidated Mail Outpatient Pharmacy Services",
                                    "number": "4.8.6.5",
                                    "parent": "Provide Pharmacy Services"
                                },
                                {
                                    "External ID": "117",
                                    "description": "Provide Pharmacy Benefits Management Systems Oversight provides operational oversight to the information systems used by the Pharmacy Benefits Management (PBM) and all pharmacy operations nationwide. It works to enhance pharmacy data exchange and clinical documentation capabilities in an integrated fashion to improve operating efficiency.",
                                    "name": "Provide Pharmacy Benefits Management Systems Oversight",
                                    "number": "4.8.6.6",
                                    "parent": "Provide Pharmacy Services"
                                },
                                {
                                    "External ID": "247",
                                    "description": "Provide Medication and Immunization Information manages a data store of information on known medications and immunizations. This includes a comprehensive, standardized list of prescription medications and over the counter medications and supplements. The data store integrates information from multiple sources. The data store includes information used to identify potential adverse drug events (ADEs) such as information on allergies and potential drug-drug interactions.",
                                    "name": "Provide Medication and Immunization Information",
                                    "number": "4.8.6.7",
                                    "parent": "Provide Pharmacy Services"
                                }
                            ],
                            "description": "Provide Pharmacy Services enhances the clinical outcomes and improve the health of Veteran patients through the appropriate use of pharmaceuticals.",
                            "name": "Provide Pharmacy Services",
                            "number": "4.8.6",
                            "parent": "Provide Ancillary Services"
                        },
                        {
                            "External ID": "71",
                            "children": [
                                {
                                    "External ID": "74",
                                    "description": "Provide Extended Institutional Care  focuses on care in an interdisciplinary environment to eligible Veterans with sufficient functional impairment to require the level of service and skill available at VA Community Living Centers, Contract Nursing Homes, or State Veterans Homes.",
                                    "name": "Provide Extended Institutional Care",
                                    "number": "4.8.7.1",
                                    "parent": "Provide Extended Care"
                                },
                                {
                                    "External ID": "75",
                                    "description": "Provide Extended Non-Institutional Care focuses on home or community based care for eligible Veterans not in need of hospital or nursing home care but still requiring supervised long-term medical and/or psychosocial health services.",
                                    "name": "Provide Extended Non-Institutional Care",
                                    "number": "4.8.7.2",
                                    "parent": "Provide Extended Care"
                                }
                            ],
                            "description": "Provide Extended Care focuses on quality care for chronically ill Veterans. This function describes the development, coordination, and integration of long-term care clinical programs as well as advancement through research, education, and evaluation of new clinical models.  Includes both institutional care and non-institutional care.",
                            "name": "Provide Extended Care",
                            "number": "4.8.7",
                            "parent": "Provide Ancillary Services"
                        },
                        {
                            "External ID": "180",
                            "description": "Provide Custodial Care provides treatment or services that can be rendered safely and reasonably by a person who is not medically skilled. They are designed mainly to help the patient with the activities of daily living.  These activities consist of providing food (including special diets), clothing, shelter, personal hygiene services, observation and general monitoring, bowel training or management, safety precautions, general preventive procedures (such as turning to prevent bedsores), passive exercise, companionship, recreation, transportation, and other elements of personal care that reasonably can be performed by an untrained adult with minimal instruction or supervision.",
                            "name": "Provide Custodial Care",
                            "number": "4.8.8",
                            "parent": "Provide Ancillary Services"
                        },
                        {
                            "External ID": "93",
                            "description": "Provide Nutrition and Food Services supports quality  Medical Nutritional Therapy (MNT), food service, and nutrition education to the Veteran.  These services are provided in both inpatient and outpatient settings.",
                            "name": "Provide Nutrition and Food Services",
                            "number": "4.8.9",
                            "parent": "Provide Ancillary Services"
                        }
                    ],
                    "description": "Provide Ancillary Services extend or facilitate primary or specialty care provided by licensed practitioners. Ancillary Services fall under three broad categories: diagnostic, therapeutic and custodial. Diagnostic includes laboratory and radiology services, Therapeutic includes  services such as pharmacy, radiology, physical therapy. Custodial Care includes nursing homes, assisted living, rehabilitation centers etc.",
                    "name": "Provide Ancillary Services",
                    "number": "4.8",
                    "parent": "Deliver Health Care"
                },
                {
                    "External ID": "682",
                    "description": "Provide  Medical Implant Logistics includes the acquisition, inventory, delivery, and tracking of medical devices manufactured to replace a missing biological structure, support a damaged biological structure, or enhance an existing biological structure.",
                    "name": "Provide Medical Implant Logistics",
                    "number": "4.9",
                    "parent": "Deliver Health Care"
                }
            ],
            "description": "Deliver Health Care provides health care to VHA beneficiaries. This includes assessing health status; planning health services; delivery of care, ensuring quality of services and continuity of care; and managing clinical information and documentation.",
            "name": "Deliver Health Care",
            "number": "4.0",
            "parent": "The Health Care Segment"
        },
        {
            "External ID": "3",
            "children": [
                {
                    "External ID": "770",
                    "children": [
                        {
                            "External ID": "771",
                            "description": "Establish Research Priorities involves activities based on diseases and conditions that are research priority areas; scientific merit of the research project; and system capability to do the research.",
                            "name": "Establish Research Priorities",
                            "number": "5.1.1",
                            "parent": "Manage Health Care Research and Development Activities"
                        },
                        {
                            "External ID": "772",
                            "description": "Establish Research Incentives includes providing and administering incentives for research efforts, which will attract and retain productive research scientists and clinicians.",
                            "name": "Establish Research Incentives",
                            "number": "5.1.2",
                            "parent": "Manage Health Care Research and Development Activities"
                        },
                        {
                            "External ID": "773",
                            "description": "Publish Research Requests puts out requests for research to the VHA and broader research community. This function solicits proposals for research that align with the VHA's strategic direction for research.",
                            "name": "Publish Research Requests",
                            "number": "5.1.3",
                            "parent": "Manage Health Care Research and Development Activities"
                        },
                        {
                            "External ID": "774",
                            "description": "Establish Clinical Research Partnerships includes establishing clinical research partnerships with other federal, public, academic, or private research institutions under the Cooperative Studies Program.",
                            "name": "Establish Clinical Research Partnerships",
                            "number": "5.1.4",
                            "parent": "Manage Health Care Research and Development Activities"
                        }
                    ],
                    "description": "Establish Research Strategic Direction sets the long term directions and priorities for research in the VHA. It sets the priorities for research, aligns incentives to the priorities and established partnerships and research requests that support the VHA's strategic direction.",
                    "name": "Manage Health Care Research and Development Activities",
                    "number": "5.1",
                    "parent": "Conduct Health Care Research"
                },
                {
                    "External ID": "775",
                    "children": [
                        {
                            "External ID": "776",
                            "description": "Write Grant Requests assembles request packages that propose research activities that VHA investigators will conduct if they are funded.",
                            "name": "Monitor Research and Development Education",
                            "number": "5.2.1",
                            "parent": "Provide Intramural Research Environment"
                        },
                        {
                            "External ID": "777",
                            "description": "Submit Grant Requests includes activities to review requests, send to the necessary review bodies and track the status of decisions made on requests.",
                            "name": "Establish Research Incentives",
                            "number": "5.2.2",
                            "parent": "Provide Intramural Research Environment"
                        }
                    ],
                    "description": "Write Research Proposals includes activities the VHA performs to secure funding for research from sources external to the VA.",
                    "name": "Provide Intramural Research Environment",
                    "number": "5.2",
                    "parent": "Conduct Health Care Research"
                },
                {
                    "External ID": "778",
                    "children": [
                        {
                            "External ID": "779",
                            "description": "Conduct Institutional Review Boards includes activities to manage boards that review research proposals VHA receives.",
                            "name": "Conduct Institutional Review Boards",
                            "number": "5.3.1",
                            "parent": "Adopt Innovative Practices"
                        },
                        {
                            "External ID": "780",
                            "description": "Perform Merit Review evaluates research proposals submitted by VA investigators to evaluate the proposals and make recommendations for funding.",
                            "name": "Perform Merit Review",
                            "number": "5.3.2",
                            "parent": "Adopt Innovative Practices"
                        },
                        {
                            "External ID": "781",
                            "description": "Select Research for Funding identifies the research proposals reviewed by the VHA that will receive funding.",
                            "name": "Select Research for Funding",
                            "number": "5.3.3",
                            "parent": "Adopt Innovative Practices"
                        }
                    ],
                    "description": "Evaluate Research Proposals involves activities to evaluate and award research grants for research projects that meet VA research priorities and should receive VHA funding.",
                    "name": "Adopt Innovative Practices",
                    "number": "5.3",
                    "parent": "Conduct Health Care Research"
                },
                {
                    "External ID": "782",
                    "children": [
                        {
                            "External ID": "783",
                            "description": "Manage Research Funding includes activities to monitor, administer and oversee research funding from all sources. Funds for research include both VA funds and funds from external sources. This function includes the specific monitoring and reporting activities required based on the type and source of research funds.",
                            "name": "Manage Research Funding",
                            "number": "5.4.1",
                            "parent": "Evaluate Research Grants"
                        },
                        {
                            "External ID": "784",
                            "description": "Set Research Standards puts in place and/or approves standards for VHA research programs, sets oversight policies to monitor, review, and investigate matters of medical research compliance and assurance of safety.",
                            "name": "Set Research Standards",
                            "number": "5.4.2",
                            "parent": "Evaluate Research Grants"
                        },
                        {
                            "External ID": "785",
                            "description": "Manage Research Subjects includes activities to identify, select, track, monitor and protect research subjects. This includes both human and non-human research subjects. This function ensures ongoing compliance with applicable protocols, standards and oversight for research subjects.",
                            "name": "Manage Research Subjects",
                            "number": "5.4.3",
                            "parent": "Evaluate Research Grants"
                        },
                        {
                            "External ID": "786",
                            "description": "Monitor Research Compliance involves monitoring and providing oversight for compliance of research activities. It includes monitoring adverse reactions and deaths related to research; securing research data and providing compliance training and education.",
                            "name": "Monitor Research Compliance",
                            "number": "5.4.4",
                            "parent": "Evaluate Research Grants"
                        }
                    ],
                    "description": "Manage Research Environment provides the environment necessary to promote quality research performed by VA employees and conducted at VA medical facilities. It includes activities that support and monitor ongoing research.",
                    "name": "Evaluate Research Grants",
                    "number": "5.4",
                    "parent": "Conduct Health Care Research"
                },
                {
                    "External ID": "787",
                    "children": [
                        {
                            "External ID": "788",
                            "description": "Conduct Research Investigation involves the actual research activities that are conducted by the VHA.",
                            "name": "Manage Research Projects with Clinical Trials",
                            "number": "5.5.1",
                            "parent": "Administer Cooperative Studies Programs"
                        },
                        {
                            "External ID": "789",
                            "description": "Capture Investigation Data manages the acquisition of research data from subjects. It gathers data from all research sources and often uses information technology to facilitate the efficient capture and management of investigation data.",
                            "name": "Establish Clinical Research Partnerships",
                            "number": "5.5.2",
                            "parent": "Administer Cooperative Studies Programs"
                        },
                        {
                            "External ID": "790",
                            "description": "Analyze Investigation Data processes captured investigation data to identify trends, test hypotheses, monitor ongoing research activities and draw initial conclusions.",
                            "name": "Analyze Investigation Data",
                            "number": "5.5.3",
                            "parent": "Administer Cooperative Studies Programs"
                        },
                        {
                            "External ID": "791",
                            "description": "Share ongoing investigation data makes data captured from ongoing research available to other investigators or organizations that have an interest in the data or are collaborating with VHA researchers on the data.",
                            "name": "Share Ongoing Investigation Data",
                            "number": "5.5.4",
                            "parent": "Administer Cooperative Studies Programs"
                        }
                    ],
                    "description": "Perform Health Care Research includes the activities to perform research and development activities across several areas to include Medical, Rehabilitation, and Health Services.",
                    "name": "Administer Cooperative Studies Programs",
                    "number": "5.5",
                    "parent": "Conduct Health Care Research"
                },
                {
                    "External ID": "792",
                    "children": [
                        {
                            "External ID": "793",
                            "description": "Peer Review Research includes activities related to the peer review processes for health care research. These activities are performed to ensure VA research meets the highest standards of scientific excellence.",
                            "name": "Peer Review Research",
                            "number": "5.6.1",
                            "parent": "Provide Bioinformatics Services"
                        },
                        {
                            "External ID": "794",
                            "description": "Publish Research Results includes activities to communicate and disseminate the results of research through journals, conferences, VHA information-sharing and similar collaboration activities.",
                            "name": "Publish Research Results",
                            "number": "5.6.2",
                            "parent": "Provide Bioinformatics Services"
                        }
                    ],
                    "description": "Share Research Results is the formal review, sharing and publication of the results of research the VHA conducts.",
                    "name": "Provide Bioinformatics Services",
                    "number": "5.6",
                    "parent": "Conduct Health Care Research"
                },
                {
                    "External ID": "795",
                    "description": "Apply Research Results works closely with health care delivery to translate the results from research into changes that improve delivery of care.  This function includes activities that encourage the dissemination and incorporation of research findings into clinical practice.",
                    "name": "Apply Research Results",
                    "number": "5.7",
                    "parent": "Conduct Health Care Research"
                }
            ],
            "description": "Conduct Health Care Research includes developing new strategies to handle diseases; identifying new means for delivery of services, methods, decision models and practices; managing clinical trials and research quality, ultimately making strides in quality improvement.",
            "name": "Conduct Health Care Research",
            "number": "5.0",
            "parent": "The Health Care Segment"
        },
        {
            "External ID": "4",
            "children": [
                {
                    "External ID": "796",
                    "description": "Provide Oversight for VHA Clinical Health Profession Trainees oversees clinical health profession trainee programs in VHA across all four clinical areas: Associated Health, Advanced Fellowships, Medical and Dental, and Nursing Education.",
                    "name": "Provide Oversight for VHA Clinical Health Profession Trainees",
                    "number": "6.1",
                    "parent": "Provide Health Care Education"
                },
                {
                    "External ID": "797",
                    "description": "Support Innovations in Health Professions Education provides support for and funds innovations and advancement in health professions education and ensures trainee program excellence.",
                    "name": "Support Innovations in Health Professions Education",
                    "number": "6.2",
                    "parent": "Provide Health Care Education"
                },
                {
                    "External ID": "798",
                    "description": "Provide Oversight for Relationships with Academic Institutions and External Entities manages relationships with academic institutions and external bodies, including accrediting bodies, subspecialty societies, member organizations and other external education and healthcare entities.",
                    "name": "Provide Oversight for Relationships with Academic Institutions and External Entities",
                    "number": "6.3",
                    "parent": "Provide Health Care Education"
                },
                {
                    "External ID": "799",
                    "description": "Provide Consultation with Internal and External Stakeholders addresses consultations with VHA, VA, executive branch and Congressional leadership and other stakeholders on academic relationships and trainee issues.",
                    "name": "Provide Consultation with Internal and External Stakeholders",
                    "number": "6.4",
                    "parent": "Provide Health Care Education"
                }
            ],
            "description": "Provide Health Care Education fosters advancement in health knowledge. This includes promoting healthcare knowledge advancement and providing for practitioner education. It also includes provision of clinical education sites for trainees across all health professions and in conjunction with educational institutions.",
            "name": "Provide Health Care Education",
            "number": "6.0",
            "parent": "The Health Care Segment"
        },
        {
            "External ID": "277",
            "children": [
                {
                    "External ID": "690",
                    "children": [
                        {
                            "External ID": "691",
                            "children": [
                                {
                                    "External ID": "280",
                                    "description": "Maintain Facilities involves establishing a facility maintenance program to ensure the upkeep and supervision of the buildings and grounds, as well as the physical plant (electric grid, HVAC, pipes, etc).",
                                    "name": "Maintain Facilities",
                                    "number": "7.1.1.1",
                                    "parent": "Manage Facilities, Assets and Equipment, and Supply Chain"
                                },
                                {
                                    "External ID": "284",
                                    "description": "Conduct Facility Shipping and Receiving involves effectively and efficiently receiving, verifying and delivering items on a regular basis that arrive at the facility. This includes preparing and shipping freight, hospital and lab supplies, equipment, personal patient items, shipment tracking, damage claims processing and proof of delivery.",
                                    "name": "Conduct Facility Shipping and Receiving",
                                    "number": "7.1.1.2",
                                    "parent": "Manage Facilities, Assets and Equipment, and Supply Chain"
                                },
                                {
                                    "External ID": "313",
                                    "description": "Conduct Supply Chain Operations involves managing supplies post-acquisition through receipt and disposition. It includes performing inventory management and inventory control (distribution) thereby ensuring adequate supplies are available to support the mission of the facility. It also includes tracking and monitoring the usage (depletion) of supplies.",
                                    "name": "Conduct Supply Chain Operations",
                                    "number": "7.1.1.3",
                                    "parent": "Manage Facilities, Assets and Equipment, and Supply Chain"
                                },
                                {
                                    "External ID": "282",
                                    "description": "Provide Facility Housekeeping involves providing housekeeping and janitorial services to ensure the cleanliness and general upkeep of facilities in accordance with national guidelines.",
                                    "name": "Provide Facility Housekeeping",
                                    "number": "7.1.1.4",
                                    "parent": "Manage Facilities, Assets and Equipment, and Supply Chain"
                                },
                                {
                                    "External ID": "285",
                                    "description": "Provide Facility Waste Management involves developing a comprehensive program for facility waste management and bio hazard management in compliance with regulatory guidelines. This may include identification of personnel and equipment, quantities and nature of generated waste, identifying areas for waste minimization and reuse or recycling of waste. Handling, shipping, transport and storage of waste are integral parts of this program.",
                                    "name": "Provide Facility Waste Management",
                                    "number": "7.1.1.5",
                                    "parent": "Manage Facilities, Assets and Equipment, and Supply Chain"
                                },
                                {
                                    "External ID": "693",
                                    "description": "Maintain Medical Assets and Equipment includes the tasks necessary to ensure the proper functioning of assets (equipment) used by health care personnel in a clinical setting.  It includes the issuing and tracking of engineering work orders for the repair and preventative maintenance of medical equipment (bio-medical engineering).",
                                    "name": "Maintain Medical Assets and Equipment",
                                    "number": "7.1.1.6",
                                    "parent": "Manage Facilities, Assets and Equipment, and Supply Chain"
                                },
                                {
                                    "External ID": "760",
                                    "description": "Maintain Non-Medical Assets and Equipment includes the tasks necessary to ensure the proper functioning of assets (equipment) used by staff often in non-clinical setting. It includes the issuing and tracking of engineering work orders for the repair and preventative maintenance of non-medical equipment.",
                                    "name": "Maintain Non-Medical Assets and Equipment",
                                    "number": "7.1.1.7",
                                    "parent": "Manage Facilities, Assets and Equipment, and Supply Chain"
                                },
                                {
                                    "External ID": "715",
                                    "description": "Manage Assets and Equipment involves monitoring assets post-acquisition through receipt and disposition. It includes inventory management, maintaining tracking records on assets, and reconciling any discrepancies. It also involves assigning category stock numbers and life expectancy values in order to monitor its lifecycle.",
                                    "name": "Manage Assets and Equipment",
                                    "number": "7.1.1.8",
                                    "parent": "Manage Facilities, Assets and Equipment, and Supply Chain"
                                }
                            ],
                            "description": "Manage Facilities, Assets, Equipment, and Supply Chain involves the monitoring, maintenance, administration, certification, and operation of buildings, fleets, machinery, and other assets that are possessions of the organization. It also includes conducting supply chain operations.",
                            "name": "Manage Facilities, Assets and Equipment, and Supply Chain",
                            "number": "7.1.1",
                            "parent": "Manage VHA-Wide Administrative Services"
                        },
                        {
                            "External ID": "281",
                            "description": "Provide Security Services involves managing the physical protection of the organization’s personnel, assets, and facilities (including security clearance management).  This involves establishing a security program (including utilization of VA facility police forces) which incorporates a series of safeguards designed to protect the physical property and ensure safety for personnel interacting within this environment. Identification and risk assessment of security vulnerabilities are part of this program.",
                            "name": "Provide Security Services",
                            "number": "7.1.2",
                            "parent": "Manage VHA-Wide Administrative Services"
                        },
                        {
                            "External ID": "694",
                            "description": "Manage Employee Travel involves the activities associated with planning, preparing, monitoring, and approving of business related travel for the organization’s employees.",
                            "name": "Manage Employee Travel",
                            "number": "7.1.3",
                            "parent": "Manage VHA-Wide Administrative Services"
                        },
                        {
                            "External ID": "757",
                            "description": "Provide Administration Policy Support involves the adoption, dissemination, and monitoring the adherence to all non-clinical administrative laws and policies.  These policies can be federally mandated or legislated within the agency. This includes alerting staff to changes in policy as well as conducting quality assurance reviews and audits to ensure compliance to all regulations.",
                            "name": "Provide Administration Policy Support",
                            "number": "7.1.4",
                            "parent": "Manage VHA-Wide Administrative Services"
                        }
                    ],
                    "description": "Manage VHA-Wide Administrative Services involves the day-to-day management and maintenance of the internal infrastructure.",
                    "name": "Manage VHA-Wide Administrative Services",
                    "number": "7.1",
                    "parent": "Manage Business Enabling Services"
                },
                {
                    "External ID": "152",
                    "children": [
                        {
                            "External ID": "764",
                            "description": "Conduct Technology Assessments involves the review, analysis, and disposition of current (as-is) and potential (to-be) technologies. It also includes conducting analysis of alternative reviews, testing and piloting of systems, and executing tool selection activities.",
                            "name": "Conduct Technology Assessments",
                            "number": "7.2.1",
                            "parent": "Provide Information Management/ Information Technology Services"
                        },
                        {
                            "External ID": "271",
                            "children": [
                                {
                                    "External ID": "276",
                                    "description": "Support Communication with Medical Devices provides support for data captured form medical devices, which may occur in the hospital, clinic or the patient's home. Some examples include vital signs, pulse oximetry home diagnostic devices for chronic illnesses, laboratory machines, bar coded artifacts (medicine, immunizations, demographics, history, and identification), etc.",
                                    "name": "Support Communication with Medical Devices",
                                    "number": "7.2.2.1",
                                    "parent": "Share Enterprise Information"
                                },
                                {
                                    "External ID": "273",
                                    "description": "Provide Electronic Information Exchange enables secure bi-directional access, sharing, and communication of information electronically between patients, practitioners, providers and pharmacies. This can include the exchange of Personal Health Information as appropriate.",
                                    "name": "Provide Electronic Information Exchange",
                                    "number": "7.2.2.2",
                                    "parent": "Share Enterprise Information"
                                }
                            ],
                            "description": "Share Enterprise Information relates to any method or function, for a given business area, facilitating: data being received in a usable medium by one or more departments or agencies as provided by a separate department or agency or other entity; and data being provided, disseminated or otherwise made available or accessible by one department or agency for use by one or more separate departments or agencies, or other entities, as appropriate.",
                            "name": "Share Enterprise Information",
                            "number": "7.2.2",
                            "parent": "Provide Information Management/ Information Technology Services"
                        },
                        {
                            "External ID": "651",
                            "description": "Provide Identity Management includes the business processes and a supporting infrastructure for the creation, maintenance, and use of digital identities and unique identification of persons. It addresses Identity and Access Management (IAM), Clinical Patient Identity Management, Person Identity Management, and Role Base Identity Management.",
                            "name": "Provide Identity Management",
                            "number": "7.2.3",
                            "parent": "Provide Information Management/ Information Technology Services"
                        },
                        {
                            "External ID": "712",
                            "children": [
                                {
                                    "External ID": "705",
                                    "description": "Provide System Development includes the planning, design, procurement and implementation of VHA owned and operated IT systems and its associated hardware and software components. This includes developing requirements, validation, training, and user (stakeholder) ownership and acceptance.",
                                    "name": "Provide System Development",
                                    "number": "7.2.4.1",
                                    "parent": "Provide Systems Development Lifecycle Management"
                                },
                                {
                                    "External ID": "714",
                                    "description": "Provide System Maintenance includes supporting all activities associated with the maintenance of VHA owned and operated IT systems and its associated hardware and software components. This includes deploying patches, replacing malfunctioning parts, reboots, reconfigurations, or other routine maintenance functions.",
                                    "name": "Provide System Maintenance",
                                    "number": "7.2.4.2",
                                    "parent": "Provide Systems Development Lifecycle Management"
                                }
                            ],
                            "description": "Provide Systems Development Lifecycle Management involves implementing the framework for planning and controlling the creation or alteration of an IT system. It also includes supporting development of Change Management (CM) processes that facilitate a smooth evolution, composition, and transition of agency resources (people, processes, and tools) in response to IT development, implementation or acquisition efforts.",
                            "name": "Provide Systems Development Lifecycle Management",
                            "number": "7.2.4",
                            "parent": "Provide Information Management/ Information Technology Services"
                        },
                        {
                            "External ID": "219",
                            "children": [
                                {
                                    "External ID": "706",
                                    "description": "Provide Information Security involves all functions pertaining to the protection of information and information systems from unauthorized access, use, disclosure, disruptions, modification, or destruction. This also includes ensuring protection of \"Protected Health Information\" (commonly referred to as PHI) from unauthorized access.",
                                    "name": "Provide Information Security",
                                    "number": "7.2.5.1",
                                    "parent": "Provide Information Management"
                                },
                                {
                                    "External ID": "708",
                                    "description": "Perform Record Retention involves the operations surrounding the retention of the official documents and records for the agency. It includes providing and managing both physical and logical storage \"vaults\" or archives. This also includes ensuring protection of \"Protected Health Information\" (commonly referred to as PHI) from unauthorized access.",
                                    "name": "Perform Record Retention",
                                    "number": "7.2.5.2",
                                    "parent": "Provide Information Management"
                                },
                                {
                                    "External ID": "221",
                                    "description": "Establish Standards for Data Exchange involves reviewing, analyzing, adopting and implementing data interoperability or data exchange standards, guidelines, and protocols.",
                                    "name": "Establish Standards for Data Interchange",
                                    "number": "7.2.5.3",
                                    "parent": "Provide Information Management"
                                },
                                {
                                    "External ID": "223",
                                    "description": "Perform Data Quality Verification and Validation involves implementing operating policies, processes and procedures to ensure data is within established standards to allow for proper management and exchange. This activity also ensures that data is in compliance with internal, federal and jurisdictional laws and regulations.",
                                    "name": "Perform Data Quality Verification and Validation",
                                    "number": "7.2.5.4",
                                    "parent": "Provide Information Management"
                                }
                            ],
                            "description": "Provide Information Management involves supporting the establishment and management of policies, guidelines, and standards regarding the collection, storage, dissemination, and destruction of  information.",
                            "name": "Provide Information Management",
                            "number": "7.2.5",
                            "parent": "Provide Information Management/ Information Technology Services"
                        }
                    ],
                    "description": "Provide Information Management/Information Technology Services involves the development, management, marshalling, and coordination of information and technology resources and systems.  Primary functions include the security of electronic information, control of information technology hardware and software, management of IT networks, and problem solving for IT users.",
                    "name": "Provide Information Management/ Information Technology Services",
                    "number": "7.2",
                    "parent": "Manage Business Enabling Services"
                },
                {
                    "External ID": "761",
                    "children": [
                        {
                            "External ID": "716",
                            "description": "Acquire Assets, Equipment, and Supplies involves initiating requests for purchases, obtaining approval for purchases, and procuring both medical and non-medical assets, equipment, and supplies.",
                            "name": "Acquire Assets, Equipment, and Supplies",
                            "number": "7.3.1",
                            "parent": "Manage Acquisitions"
                        },
                        {
                            "External ID": "720",
                            "description": "Manage Contracts involves the oversight and management of contracts between the VHA and private sector service providers.  It includes contracting for utilities (water, gas, electricity, and communications) as well as contracts for service (nursing homes, purchased care, and construction).",
                            "name": "Manage Contracts",
                            "number": "7.3.2",
                            "parent": "Manage Acquisitions"
                        }
                    ],
                    "description": "Manage Acquisitions involves the procurement of assets, equipment, supplies, and services (contracts).",
                    "name": "Manage Acquisitions",
                    "number": "7.3",
                    "parent": "Manage Business Enabling Services"
                },
                {
                    "External ID": "721",
                    "children": [
                        {
                            "External ID": "722",
                            "description": "Manage Employee Performance designs, develops, and implements a comprehensive performance management approach to ensure agency employees are demonstrating competencies required of their work assignments. Design, develop and implement a comprehensive performance management strategy that enables managers to make distinctions in performance and links individual performance to agency goal and mission accomplishment. This also includes managing employee performance at the individual level and evaluating the overall effectiveness of the agency’s employee development approach.",
                            "name": "Manage Employee Performance",
                            "number": "7.4.1",
                            "parent": "Manage Human Resources"
                        },
                        {
                            "External ID": "731",
                            "description": "Manage Employee Benefits designs, develops, and implements benefit programs that attract, retain and support current and former agency employees. This includes: establishing and communicating benefits programs; processing benefits actions; and interacting as necessary with third party benefits providers.",
                            "name": "Manage Employee Benefits",
                            "number": "7.4.10",
                            "parent": "Manage Human Resources"
                        },
                        {
                            "External ID": "732",
                            "description": "Manage Labor Relations provides oversight of the relationship between the agency and its unions and bargaining units. This includes negotiating and administering labor contracts and collective bargaining agreements; managing negotiated grievances; and participating in negotiated third party proceedings.",
                            "name": "Manage Labor Relations",
                            "number": "7.4.11",
                            "parent": "Manage Human Resources"
                        },
                        {
                            "External ID": "723",
                            "description": "Manage Staff Recruitment and Retention establishes procedures for recruiting, selecting, and retaining high-quality, productive employees with the right skills and competencies, in accordance with merit system principles. This includes: developing a staffing strategy and plan (to include the targeted recruitment of Veterans); establishing an applicant evaluation approach; announcing the vacancy, sourcing and evaluating candidates against the competency requirements for the position; initiating pre-employment activities; and hiring employees",
                            "name": "Manage Staff Recruitment and Retention",
                            "number": "7.4.2",
                            "parent": "Manage Human Resources"
                        },
                        {
                            "External ID": "724",
                            "description": "Manage Employee Relations designs, develops, and implements programs that strive to maintain an effective employer-employee relationship that balance the agency’s needs against its employees’ rights. This includes: addressing employee misconduct; addressing employee performance problems; managing  administrative grievances; providing employee accommodation; administering employees assistance programs; participating in administrative third party proceedings; and determining candidate and applicant suitability.",
                            "name": "Manage Employee Relations",
                            "number": "7.4.3",
                            "parent": "Manage Human Resources"
                        },
                        {
                            "External ID": "725",
                            "description": "Manage Workforce Time and Attendance involves recording the working and non-working hours of employees, contractors, volunteers, and other members of the workforce. The recording of the number of hours spent on specific tasks is used by job costing, workload forecasting, payroll processing and other activities.",
                            "name": "Manage Workforce Time and Attendance",
                            "number": "7.4.4",
                            "parent": "Manage Human Resources"
                        },
                        {
                            "External ID": "726",
                            "description": "Manage Employee Separations conducts efficient and effective employee separation programs that assist employees in transitioning employment to outside the agency; facilitates the removal of unproductive, non-performing employees; and assists employees in transitioning to retirement.",
                            "name": "Manage Employee Separations",
                            "number": "7.4.5",
                            "parent": "Manage Human Resources"
                        },
                        {
                            "External ID": "381",
                            "children": [
                                {
                                    "External ID": "727",
                                    "description": "Monitor Employee Training provides for tracking and monitoring all personnel training.",
                                    "name": "Monitor Employee Training",
                                    "number": "7.4.6.1",
                                    "parent": "Provide Human Resources Development"
                                },
                                {
                                    "External ID": "624",
                                    "description": "Provide Employee Development Training is responsible for the appropriate staff receiving the appropriate training for the development and maintenance of a competent workforce. It establishes responsibility and procedures for designating education or training as mandatory or required. Training needs may originate from Executive Orders, Congressional mandates, Office of Personnel Management, the agency, and its various program offices or other regulatory agencies.",
                                    "name": "Provide Employee Development Training",
                                    "number": "7.4.6.2",
                                    "parent": "Provide Human Resources Development"
                                }
                            ],
                            "description": "Provide Human Resources Development designs, develops, and implements a comprehensive employee development approach to ensure that agency employees have the right competencies and skills for current and future work assignments. This includes conducting employee development needs assessments; designing employee development programs; administering and delivering employee development programs; and evaluating the overall effectiveness of the agency’s employee development approach.",
                            "name": "Provide Human Resources Development",
                            "number": "7.4.6",
                            "parent": "Manage Human Resources"
                        },
                        {
                            "External ID": "382",
                            "description": "Provide Organization and Position Management designs, develops, and implements organizational and position structures that create a high-performance, competency-driven framework that both advances the agency mission and serves agency human capital needs.",
                            "name": "Provide Organization and Position Management",
                            "number": "7.4.7",
                            "parent": "Manage Human Resources"
                        },
                        {
                            "External ID": "729",
                            "description": "Provide Human Resources Strategy develops effective human capital management strategies to ensure the organization is able to recruit, select, develop, train, and manage a high-quality, productive workforce in accordance with merit system principles. This includes: conducting both internal and external environmental scans; developing human resources and human capital strategies and plans; establishing human resources policy and practices; managing current and future workforce competencies; developing workforce plans; developing succession plans; managing the human resources budget; providing human resources and human capital consultative support; and measuring and improving human resources performance.",
                            "name": "Provide Human Resources Strategy",
                            "number": "7.4.8",
                            "parent": "Manage Human Resources"
                        },
                        {
                            "External ID": "730",
                            "description": "Manage Employee Compensation designs, develops, and implements compensation programs that attract, retain and fairly compensate agency employees. In addition, designs, develops, and implements pay for performance compensation programs to recognize and reward high performance, with both base pay increases and performance bonus payments. This function includes: developing and implementing compensation programs; administering bonus and monetary awards programs; administering pay changes; managing leave and payroll.",
                            "name": "Manage Employee Compensation",
                            "number": "7.4.9",
                            "parent": "Manage Human Resources"
                        }
                    ],
                    "description": "Manage Human Resources involves all activities associated with the recruitment and management of personnel, to include employees, contractors, volunteers and other members of the workforce. It involves HR Strategy which develops effective human capital management strategies to ensure federal organizations are able to recruit, select, develop, train, and manage a high-quality, productive workforce in accordance with merit system principles. This also includes: establishing human resources policy and practices; managing current and future workforce competencies; developing workforce plans; developing succession plans; managing the human resources budget; providing human resources and human capital consultative support; and measuring and improving human resources performance.",
                    "name": "Manage Human Resources",
                    "number": "7.4",
                    "parent": "Manage Business Enabling Services"
                },
                {
                    "External ID": "300",
                    "children": [
                        {
                            "External ID": "309",
                            "children": [
                                {
                                    "External ID": "310",
                                    "description": "Manage General Ledger involves recording financial transactions and providing controls to enable financial data management. It is responsible for maintaining accurate account balances, reconciliation of accounts, accounting entries for gifts and donations, creating and processing journal entries, and processing monthly/yearly closeout accounting cycles.",
                                    "name": "Manage General Ledger",
                                    "number": "7.5.1.1",
                                    "parent": "Provide Accounting Services"
                                },
                                {
                                    "External ID": "325",
                                    "description": "Provide Veteran Personal Finance Management involves managing individual patient accounts for Veterans not able to manage their own accounts.  Personal funds are held under this account for patients and for authorized expenditures on behalf of patients as prescribed in 38 USC 3204.",
                                    "name": "Provide Veteran Personal Finance Management",
                                    "number": "7.5.1.2",
                                    "parent": "Provide Accounting Services"
                                },
                                {
                                    "External ID": "737",
                                    "description": "Manage Construction Accounts is performed during construction when federally appropriated funds need to be managed until the building is accepted and capitalized as a VHA asset.",
                                    "name": "Manage Construction Accounts",
                                    "number": "7.5.1.3",
                                    "parent": "Provide Accounting Services"
                                },
                                {
                                    "External ID": "740",
                                    "description": "Provide Funds Control includes the management of the federal budget process including the development of plans and programs, budgets, and performance outputs. It includes managing fund transfers, investments, obligations of expenditures, year-end closing process and other financing mechanisms.",
                                    "name": "Provide Funds Control",
                                    "number": "7.5.1.4",
                                    "parent": "Provide Accounting Services"
                                },
                                {
                                    "External ID": "738",
                                    "description": "Report Financial Information includes providing financial information, reporting, and analysis of financial transactions. It includes analyzing cost distribution data and other financial information (cost variance) for accuracy to support account reconciliation.",
                                    "name": "Report Financial Information",
                                    "number": "7.5.1.5",
                                    "parent": "Provide Accounting Services"
                                }
                            ],
                            "description": "Provide Accounting Services entails accounting for assets, liabilities, fund balances, revenues and expenses associated with the maintenance of federal funds and expenditure of federal appropriations (Salaries and Expenses, Operation and Maintenance, Procurement, Working Capital, Real Property, Work in Progress and Construction, Trust Funds, etc.), in accordance with applicable federal standards.",
                            "name": "Provide Accounting Services",
                            "number": "7.5.1",
                            "parent": "Provide Financial Management"
                        },
                        {
                            "External ID": "316",
                            "children": [
                                {
                                    "External ID": "317",
                                    "description": "Disposition Medical Care Payment Claims involves the validation, review, and approval of received claims from third party health care providers. It involves the administrative/financial review (in conjunction with the proper clinical review), validation and approval of eligibility for purchased care benefits (Fee Basis and CHAMPVA).",
                                    "name": "Disposition Medical Care Payment Claims",
                                    "number": "7.5.2.1",
                                    "parent": "Manage Payments"
                                },
                                {
                                    "External ID": "762",
                                    "description": "Disposition Invoices involves the validation, review, and approval of invoices from third party vendors. It involves validation, review and approval of supply purchase orders, and receiving notification of receipt of goods and services. Once approved, final payment information is transmitted to a payment processing center for processing and disbursement.",
                                    "name": "Disposition Invoices",
                                    "number": "7.5.2.2",
                                    "parent": "Manage Payments"
                                },
                                {
                                    "External ID": "739",
                                    "description": "Manage Payroll involves the receipt and review of time and attendance information, wage grades tables and pay scales for calculating VHA employee salary. Final payroll information is transmitted to a payment processing center for processing and disbursement.",
                                    "name": "Manage Payroll",
                                    "number": "7.5.2.3",
                                    "parent": "Manage Payments"
                                },
                                {
                                    "External ID": "733",
                                    "description": "Process Payments involves the receipt, processing, and release of payment to Defense Finance Accounting System (DFAS) that result in the disbursement of federal funds. It involves Treasury payment processing, reconciliation, and offset programs.",
                                    "name": "Process Payments",
                                    "number": "7.5.2.4",
                                    "parent": "Manage Payments"
                                }
                            ],
                            "description": "Manage Payments includes disbursements of agency funds to individuals, federal, state, local and international governments, and the private sector, to effect payment for financial benefits, compensation, salaries, reimbursements, and payments for goods and services. This activity creates financial control to prevent double payments. It also allows visibility of required information. It includes preparation, approval, scheduling and processing of transactions that result in the disbursement of federal funds.",
                            "name": "Manage Payments",
                            "number": "7.5.2",
                            "parent": "Provide Financial Management"
                        },
                        {
                            "External ID": "301",
                            "children": [
                                {
                                    "External ID": "302",
                                    "description": "Process Receipt of Payment involves the handling of funds that is directly received by the VHA from external sources. It includes making new entries or closing out existing receivables entries in the General Ledger and managing the parsing of funds to the correct party. This also involves the receipt and handling of beneficiary co-payments for services received at VHA facilities.",
                                    "name": "Process Receipt of Payment",
                                    "number": "7.5.3.1",
                                    "parent": "Manage Collections and Receivables"
                                },
                                {
                                    "External ID": "304",
                                    "description": "Perform Collections Processing involves preparing Statements of Account to collect as appropriate when third party collections are warranted. It includes researching and discovery of monies due, receiving remittances and following up on overdue payments.",
                                    "name": "Perform Collections Processing",
                                    "number": "7.5.3.2",
                                    "parent": "Manage Collections and Receivables"
                                },
                                {
                                    "External ID": "763",
                                    "description": "Disposition Collection Disputes involves managing the receipt, processing, and determining acceptance or denial of submitted disputes for payment or write-offs.",
                                    "name": "Disposition Collection Disputes",
                                    "number": "7.5.3.3",
                                    "parent": "Manage Collections and Receivables"
                                },
                                {
                                    "External ID": "306",
                                    "description": "Perform Billing and Claims Submissions involves the creation and disbursement of \"Bills of Collections\" for the recoupment of funds due to the VHA. This includes billing of any and all parties or persons (including insurance companies), employees. This also triggers the creation of a receivables entry into the General Ledger.",
                                    "name": "Perform Billing and Claims Submissions",
                                    "number": "7.5.3.4",
                                    "parent": "Manage Collections and Receivables"
                                },
                                {
                                    "External ID": "305",
                                    "description": "Manage Health Care Cost Recovery involves the verification and confirmation of third party private/commercial health insurance coverage for beneficiaries and determining the appropriate medical care cost recovery claim amounts the VHA will submit to the insurance provider. It also includes obtaining pre-authorization from insurance companies if necessary.",
                                    "name": "Manage Health Care Cost Recovery",
                                    "number": "7.5.3.5",
                                    "parent": "Manage Collections and Receivables"
                                }
                            ],
                            "description": "Manage Collections and Receivables involves managing the receipt of funds, gifts, and donations, offset of payments, invoicing, processing of deposits, fund transfers, and receipts for service. This includes the accounting for all monies owed to the organization from other agencies, contractors, third party providers and vendors (insurance companies), beneficiaries, employees, etc. It also executes the authority granted to VA in 1986 to seek reimbursement from third-party insurers and assess copayments for furnished care to certain Veterans with annual incomes above an amount set by law.",
                            "name": "Manage Collections and Receivables",
                            "number": "7.5.3",
                            "parent": "Provide Financial Management"
                        },
                        {
                            "External ID": "314",
                            "description": "Provide Cost Accounting and Performance Measurement involves accumulating, measuring, analyzing, interpreting, and reporting cost information in order to accurately determine the VHA's operating costs. Cost accounting information uses clinical and financial data to support activity based costing and clinical productivity analysis. Also, cost accounting, financial accounting, human resources management, and budgetary accounting all draw information from common data sources.",
                            "name": "Provide Cost Accounting and Performance Measurement",
                            "number": "7.5.4",
                            "parent": "Provide Financial Management"
                        }
                    ],
                    "description": "Provide Financial Management includes performing functions related to financial management activities and reconciliation as well as functions related to transfer of funds between stakeholders and entities related to provision of medical care.  All financial management activities will adhere to VA and VHA financial directives and handbooks as well as other appropriate governance regulations and guidelines, and will maintain appropriate internal controls.  This activity also includes financial reporting, financial statements, and financial audits.",
                    "name": "Provide Financial Management",
                    "number": "7.5",
                    "parent": "Manage Business Enabling Services"
                },
                {
                    "External ID": "741",
                    "children": [
                        {
                            "External ID": "742",
                            "description": "Perform Budget Formulation involves all activities undertaken to determine priorities for future spending and to develop an itemized forecast of future funding and expenditures during a targeted period of time. This includes the collection and use of performance information to assess the effectiveness of programs and develop budget priorities.",
                            "name": "Perform Budget Formulation",
                            "number": "7.6.1",
                            "parent": "Perform Planning and Budgeting"
                        },
                        {
                            "External ID": "743",
                            "description": "Perform Capital Planning involves the processes for ensuring that appropriate investments are selected for capital expenditures.",
                            "name": "Perform Capital Planning",
                            "number": "7.6.2",
                            "parent": "Perform Planning and Budgeting"
                        },
                        {
                            "External ID": "744",
                            "description": "Provide Business Architecture involves implementing an established process for describing the current state and defining the target state and transition strategy for an organization’s people, processes, and technology. This includes collaboration with other enterprise architecture service groups such as OneVA.",
                            "name": "Provide Business Architecture",
                            "number": "7.6.3",
                            "parent": "Perform Planning and Budgeting"
                        },
                        {
                            "External ID": "745",
                            "description": "Perform Strategic Planning  entails the determination of annual and long-term goals incorporating trend analysis, and the identification of the best approach for achieving those goals.",
                            "name": "Perform Strategic Planning",
                            "number": "7.6.4",
                            "parent": "Perform Planning and Budgeting"
                        },
                        {
                            "External ID": "746",
                            "description": "Perform Budget Execution  involves the legal (apportionment) and managerial (allotment and sub-allotment) distribution of budget authority to achieve results consistent with the formulated budget.",
                            "name": "Perform Budget Execution",
                            "number": "7.6.5",
                            "parent": "Perform Planning and Budgeting"
                        },
                        {
                            "External ID": "747",
                            "description": "Perform Management Improvement includes all efforts to gauge the ongoing efficiency of business processes and identify opportunities for reengineering or restructuring, as well as VHA Redesign Initiative.",
                            "name": "Perform Management Improvement",
                            "number": "7.6.6",
                            "parent": "Perform Planning and Budgeting"
                        },
                        {
                            "External ID": "748",
                            "description": "Perform Budget and Performance Integration involves activities that align Federal resources allocated through budget formulation, execution, and management actions with examinations of program objectives, performance, and demonstrated results.",
                            "name": "Perform Budget and Performance Integration",
                            "number": "7.6.7",
                            "parent": "Perform Planning and Budgeting"
                        }
                    ],
                    "description": "Perform Planning and Budgeting involves the activities of determining strategic direction, identifying and establishing programs and processes, and allocating resources (capital and labor) among those programs and processes.",
                    "name": "Perform Planning and Budgeting",
                    "number": "7.6",
                    "parent": "Manage Business Enabling Services"
                },
                {
                    "External ID": "749",
                    "description": "Provide Enterprise Reporting involves the regular provision of information to decision-makers to support them in their work. These reports can take the form of graphs, text and tables, or written text. They may be disseminated through an intranet as a set of regularly updated web pages, emailed directly to users, or simply printed out and distributed manually. This activity often  involves the use of decision support systems for online analytical processing including data mining and predictive analytics.",
                    "name": "Provide Enterprise Reporting",
                    "number": "7.7",
                    "parent": "Manage Business Enabling Services"
                }
            ],
            "description": "Manage Business Enabling Services includes business and enterprise services that support the health care mission activities.",
            "name": "Manage Business Enabling Services",
            "number": "7.0",
            "parent": "The Health Care Segment"
        }
    ],
    "description": "The Health Care Segment uses federal programs and activities to provide for the health and well-being of the public. This includes the direct provision of health care services and immunizations as well as the monitoring and tracking of public health indicators for the detection of trends and identification of widespread illnesses/diseases. It also includes health care benefit programs.",
    "name": "The Health Care Segment",
    "number": "0"
}
